[{
	"ModuleCode": "EB5102",
	"ModuleTitle": "Data Analytics",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "This course introduces key data analytic algorithms and techniques used in data–rich business analytics projects. It covers comprehensive analytic techniques including basic statistical and quantitative analysis, querying and reporting techniques, and extensive data mining techniques. It is designed with a practical focus of applying these techniques to answer business questions. \r\nParticipants will learn the skills to successfully implement analytic solutions using various data analytic techniques, and develop a critical awareness of a wide range of commercial and open source business intelligence/analytics tools through the lectures and workshops.",
	"CrossModule": "",
	"ModuleCredit": "8",
	"Workload": "3-1-1-10-5",
	"Prerequisite": "EB5001 Foundations of Business Analytics",
	"Preclusion": "NIL",
	"Corequisite": "NIL"
}, {
	"ModuleCode": "EB5104",
	"ModuleTitle": "Decision Making and Optimization",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "The course aims to equip students with knowledge and skills to optimize business problems with large number of constraints and variables. Techniques, including linear programming, the transportation model, network models, goal programming, non-linear programming, and inventory models will enable students to address a wide range of applications in healthcare, logistics, defence, transportation, logistics, and economics. Students will learn how to formulate a model for the business problem, by identifying the decision variables, objective function and constraints. They will then learn how to validate their model, determine the optimal solution perform sensitivity analysis, and interpret the results, and make recommendations for decision making.",
	"CrossModule": "",
	"ModuleCredit": "8",
	"Workload": "3-1-1-10-5",
	"Prerequisite": "EB5001 Foundations of Business Analytics",
	"Preclusion": "NIL",
	"Corequisite": "NIL"
}, {
	"ModuleCode": "EB5202",
	"ModuleTitle": "Web Analytics",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "This course introduces Web analytics techniques that are suitable for developing Web-based intelligent systems, optimizing website design and improving customer experience. In this course, participants will be exposed to the key concepts, techniques and practices of Web analytics. It provides an overview of three major types of Web analytics/mining tasks, i.e., usage mining, content mining and structure mining. It also illustrates various ecommerce and business intelligence applications using techniques such as user preference tracking, user profiling and personalization.",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "1.5-0.5-0.5-3-2",
	"Prerequisite": "EB5001 Foundations of Business Analytics",
	"Preclusion": "NIL",
	"Corequisite": "NIL"
}, {
	"ModuleCode": "EB5204",
	"ModuleTitle": "New Media and Sentiment Mining",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "The prevalence of social media has enabled normal users to openly voice their opinions and share their experiences about various products or services. These have provided businesses with additional channels to monitor and manage their reputation, increase customer engagement, and discover new opportunities.\r\nThis course introduces the concepts and techniques for opinion extraction from unstructured text and the classification of sentiment polarity. Participants will learn how to find textual sources containing expressions of opinion/sentiment, and use computerised tools to perform various sentiment analysis tasks.",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "1.5-0.5-0.5-3-2",
	"Prerequisite": "EB5001 Foundations of Business Analytics",
	"Preclusion": "NIL",
	"Corequisite": "NIL"
}, {
	"ModuleCode": "EB5206",
	"ModuleTitle": "Supply Chain Analytics",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "Effective logistics and supply chain management requires strategic, quantitative and tactical techniques that can be harnessed through data analytics and intelligent methods. This course introduces data analytics from the perspective of a decision support system (DSS) with emphasis on integration of information, inventory, transportation and location of material, capital and human resources.\r\nThrough a series of workshops, simulations and case studies, the course provides a tool-kit that is built on forecasting, networking and warehousing algorithms that contribute towards optimized decision making vis-à-vis cost control, operations and stakeholder relationship management.",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "3-1-1-3-2",
	"Prerequisite": "EB5001 Foundations of Business Analytics",
	"Preclusion": "NIL",
	"Corequisite": "NIL"
}, {
	"ModuleCode": "EB5207",
	"ModuleTitle": "Service Analytics",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "The objective of this course is to gain insights into how analytic tools are transforming the conventions and practices of the tourism and hospitality industries to increase product and service differentiation. Using predictive analytics, participants will learn how to identify new selling opportunities, enhance product and service offerings, create better pricing models, and improving overall customer satisfaction and loyalty. Some key analyses include customer behaviour, campaign effectiveness, customer profitability, basket analysis, demand forecasting and churn models. Students will be lead through the various stages of analysis starting from preparation of raw data, exploratory data analysis, analytical modelling to results interpretation.",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "1.5-0.5-0.5-3-2",
	"Prerequisite": "EB5001 Foundations of Business Analytics",
	"Preclusion": "NIL",
	"Corequisite": "NIL"
}, {
	"ModuleCode": "IL5101",
	"ModuleTitle": "Strategic Alignment of Business and IT",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "IT leaders need to cultivate deep business knowledge to successfully enable business initiatives supported by IT. They must possess not only technical leadership but also the business acumen and strategic vision to create and monitor value from technology investments. Effective IT leaders participate in the setting of clear and concise technology-enabled business strategies to rejuvenate and transform their organization, exploit new business opportunities, and solve cross-functional business issues to deliver competitive advantage. Students will learn in this course the concepts and methodologies to formulate and implement business-IT strategies.",
	"CrossModule": "",
	"ModuleCredit": "4",
	"Workload": "2.0-1.0-1.0-5.0-1.0",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "IL5102",
	"ModuleTitle": "IT Innovation Leadership",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "The rate of today’s technological change is affecting businesses in unprecedented ways, confronting them with new technologies that are disrupting business models and transforming industries. This challenges IT leaders to move beyond IT projects for purely efficiency purposes to become leaders of IT innovation to spawn fresh, value-generating ideas, and ensure their successful implementation to help their businesses grow. They need to build an agile, innovative, creative and entrepreneurial spirit in the IT organization. Students will learn the concepts, enablers and inhibitors of IT innovation and a framework for innovation management. They will also learn design thinking, entrepreneurship and business models.",
	"CrossModule": "",
	"ModuleCredit": "4",
	"Workload": "2.0-1.0-1.0-5.0-1.0",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "IL5105",
	"ModuleTitle": "Fundamentals of IT Leadership Transformation",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "The module will introduce students to the core foundation of leadership, sharpen their understanding of the role of the IT leader, and enhance their capacity and capability to be agile and effective IT Leaders.  Students will hone their leadership capacity in the areas of self-awareness; strategic and critical thinking, communications, team building, problem solving, decision making and influencing so as to create sustainable competitive advantage and business value for their organizations.",
	"CrossModule": "",
	"ModuleCredit": "4",
	"Workload": "1.5-1.5-1.0-5.0-1.0",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "IL5202",
	"ModuleTitle": "IT Governance and Risk Management",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "The pervasive use of the Internet and technology for the conduct of business, and the complexity of organizations mandate the adoption of an effective and pragmatic IT governance and risk management framework to bind business and IT strategies. This will allow companies to reap the full benefit of exploiting IT to meet business goals and sustain competitive advantage. The urgency is further compounded by the recent high profile cases on data leakage and system breaches. IT governance risk and compliance (IT GRC) is therefore now a top priority for IT leaders. This course presents a holistic overview of IT GRC.",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "1.5-0.5-0.5-3.0-2.0",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "IL5204",
	"ModuleTitle": "Stakeholder Relationship Management in the IT Eco-System",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "Delivering business value to the organization is a key measure of success for any IT initiative. Perceptions of success are dependent on the stakeholder’s expectations, which may not be perfectly aligned with the intent of the initiative. Typically, the IT Leader needs to manage the expectations of various external and internal stakeholders in the IT eco-system by engaging them and fostering the relationship using his position, personal influence and political savvy; providing necessary and essential guidance, insights and value propositions. This module examines the principles, concepts, and frameworks used in stakeholder analysis to define relevant strategies to manage the relationships.",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "1.5-0.5-0.5-3.0-2.0",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "KE5106",
	"ModuleTitle": "Data Warehousing for Business Analytics",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "The aim of this second core course - unit 3 of the Master of Technology (MTech) in Knowledge Engineering (KE) - is to present Data Warehousing as an important preparatory process in the development of intelligent systems for Business Analytics. \r\nThe objectives of the course are to: \r\n(1) Present the fundamental principles and practices of Data Warehousing. \r\n(2) Present the Data Warehousing process through the discussion of data modelling, dimension design, domain knowledge acquisition, understanding and modelling \r\ncustomer requirements, identifying data sources, data extraction, cleansing and transformation, data loading onto the analytical engine, and data preparation and \r\nexploration.",
	"CrossModule": "",
	"ModuleCredit": "8",
	"Workload": "3.0-1.0-1.0-10.0-5.0",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "KE5108",
	"ModuleTitle": "Developing Intelligent Systems for Performing Business Analytics",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "The aim of this fourth core course - unit 7 of the Master of Technology (MTech) in Knowledge Engineering (KE) - is to discuss the system engineering (ie: modelling and \r\ndevelopment) of intelligent systems for Business Analytics. \r\nThe objectives of the course are to: \r\n(1) Present the major stages of development cycle, including problem understanding, problem modelling, system architecture and design, algorithm/technique selection and system development and fine-tuning. \r\n(2) Introduce some of the typical hybrid architectures of intelligent system for problem solving in the Business Analytics context. (3) Discuss some advanced techniques and algorithms \r\nand their role in Business Analytics.",
	"CrossModule": "",
	"ModuleCredit": "8",
	"Workload": "3.0-1.0-1.0-10.0-5.0",
	"Prerequisite": "KE4102 Intelligent Systems and Techniques for Business Analytics \r\nKE5107 Data Mining Methodology and Methods",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "KE5205",
	"ModuleTitle": "Text Mining",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "The course aims to equip students with knowledge and skills to effectively mine large amounts of unstructured textual data to discover themes, patterns, and trends for\r\nbusiness intelligence, research, or investigation. The students will be introduced to the concepts, techniques, and methods for common text mining tasks, such as data\r\npre-processing and preparation, linguistic/knowledge resources management, concept extraction, text categorization, clustering, association analysis, and trend\r\ndetection. The scenario-based case studies will enable the students to understand the application of text mining in business and research context, whereas hands-on\r\nworkshops will allow them to practice performing the above mining tasks following a text mining process.",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "1.5-0.5-0.5-3-2",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "KE5207",
	"ModuleTitle": "Computational Intelligence II",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "The aim of this elective course of the Master of Technology (MTech) in Knowledge Engineering (KE) is to introduce Fuzzy Systems, Rough Sets, Bayesian Nets and \r\nEvolutionary Computation and their role in the development of intelligent systems for Business Analytics The objectives of the course are to: \r\n(1) Introduce computational intelligence techniques with a focus on Fuzzy Systems, Rough Sets, Bayesian Nets and Evolutionary Computation. \r\n(2) Explore how these techniques can be used to construct intelligent systems to solve real-world problems such as reasoning, decision making and optimization.",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "1.0-0.5-0.5-3.0-2.0",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "KE5208",
	"ModuleTitle": "Sense Making and Insight Discovery",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "Sense-making is the process of creating situational awareness and understanding in situations of high complexity or uncertainty in order to make decisions. Strategic data analytics based solutions can be roughly modelled at three levels: sensing, sense-making and decision making. This module focuses on sense-making which is the ability to describe, diagnose and resolve problem situations in a multi-sensor (up to thousands of sensors) environment. It complements existing MTech KE\ncourses by developing practical know-how in data processing, data analysis, event processing, data visualization and insights discovery techniques.",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "1.5-0.5-0.5-3-2",
	"Prerequisite": "There are no hard prerequisites in terms of existing courses, but it would be desirable for students to have some interest in data mining.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "SA4101",
	"ModuleTitle": "Software Analysis and Design",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "- Fundamentals of Programming using C#\r\n- Object Oriented Programming using C#\r\n- User Interface Development with Visual Studio Net and C#\r\n- SQL Programming &amp; DBMS\r\n- Enterprise System Development using .Net Framework\r\n",
	"CrossModule": "",
	"ModuleCredit": "6",
	"Workload": "3-1-2-4.5-4.5",
	"Prerequisite": "NIL",
	"Preclusion": "NIL",
	"Corequisite": "NIL"
}, {
	"ModuleCode": "SA4102",
	"ModuleTitle": "Enterprise Solutions Design and Development",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "- Application Development Life Cycle I\r\n- Application Development Life Cycle II\r\n",
	"CrossModule": "",
	"ModuleCredit": "8",
	"Workload": "5-1-3-6-6",
	"Prerequisite": "NIL",
	"Preclusion": "NIL",
	"Corequisite": "NIL"
}, {
	"ModuleCode": "SA4104",
	"ModuleTitle": "Software Engineering",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "- Application Development Life Cycle III\r\n- Project Management\r\n",
	"CrossModule": "",
	"ModuleCredit": "4",
	"Workload": "16.5-8-0-8-0; 20-0-6-6.5-0",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "SA4105",
	"ModuleTitle": "Web Application Development",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "- Java Programming\r\n- Java Object Persistence\r\n- Web-based J2EE Applications\r\n- Wireless Technology\r\n- J2EE Project\r\n",
	"CrossModule": "",
	"ModuleCredit": "6",
	"Workload": "3-1-2-4.5-4.5",
	"Prerequisite": "NIL",
	"Preclusion": "NIL",
	"Corequisite": "NIL"
}, {
	"ModuleCode": "SA4106",
	"ModuleTitle": "AD Project",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "- Application Development Project\r\nThis is a pre-internship project where the students will work in a team to apply the project management, analysis, design, business communications and programming skills learnt earlier in the course. Based on a User Requirement Statement given to the students, they will go through a complete software development life cycle to develop and deliver the required system. The students will capture requirements through user interviews, produce a feasible design of the system, code, test and implement the solution in a distributed platform. This project provides a simulation of the real-life IT working environment, and tests their strengths in working closely as a project team.",
	"CrossModule": "",
	"ModuleCredit": "6",
	"Workload": "0-0-0-15-0",
	"Prerequisite": "NIL",
	"Preclusion": "NIL",
	"Corequisite": "NIL"
}, {
	"ModuleCode": "SA4108",
	"ModuleTitle": "Mobile Application Development",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "The aim of this elective course is to allow students of the Graduate Diploma in Systems Analysis (GDipSA) to specialise in mobile application development. Students will acquire the mobile-related skill-sets required by an increasing number of employers who need developers for their mobile-related projects. Students will learn to design and develop mobile applications using the Android and iOS platforms and the associated Java and Objective C programming languages. The course includes classroom teaching, lab exercises and hands-on design and development projects using both platforms.",
	"CrossModule": "",
	"ModuleCredit": "8",
	"Workload": "5.0-1.0-2.0-6.0-6.0",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "SG4206",
	"ModuleTitle": "Enterprise Integration",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "The objectives of this course are to teach students the different technologies that are currently being used to meet the integration needs of organizations, to show how to perform architectural analysis, design and implementation for an enterprise integration solution, to identify possible architectural options and determine the most suitable option for a given business scenario, and how to plan and manage integration. Topics covered in the course include fundamental concepts of Enterprise Integration; an overview of critical technologies; Integration Methodology, B2B Integration, and Web Services for Enabling Integration. There will be a Design/Programming assignment.  This course is intended for IT professionals who are involved in developing or integrating enterprise-wide applications.",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "1.5-0.5-0.5-3-1.8",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "SG5101",
	"ModuleTitle": "Software Analysis & Design",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "SG5101-1 Object-Oriented Requirements & Analysis\r\nThe objectives of this module are to introduce students to OO development. The OO lifecycle will be illustrated using the Rational Unified Process (RUP). The course describes the RUP OOAD method and how to use the Rational CASE tools; The course also describes the various activities and artifacts created during OO requirements analysis, including creating the user requirement specification, Requirements modeling: and developing the Use Case model, creating the domain object model. The course then goes to describe analysis modeling, including constructing the analysis object model and assigning operations. There will be an OO Requirements and analysis assignment. This module is compulsory for all SE students.\r\n\r\nSG5101-2 Object Oriented Design & Implementation\r\nThe objectives of this module are to teach students how to design and implement OO systems. The course will begin by revisiting the OO lifecycle, and concentrating on design and implementation issues. The course will then describe details of design modeling, including construction of the design object model, how to assign attributes; and constructing interaction diagrams; Advanced issues such as interacting with RDBMS, the relationship with Client/Server implementations and distributed computing are also explored. Finally implementing RUP projects, with examples of RUP projects moving into Java are given. There will be an OO implementation assignment. This module is compulsory for all SE students.",
	"CrossModule": "",
	"ModuleCredit": "8",
	"Workload": "3-1-1-9.2-5",
	"Prerequisite": "SG4101 BASIC SOFTWARE ENGINEERING DISCIPLINE",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "SG5103",
	"ModuleTitle": "SOFTWARE QUALITY MANAGEMENT",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "SG5103-1 Software Quality Engineering\r\nThe objective of this course is to provide an introduction to Software quality engineering It begins by describing features of modern quality thinking, including Deming?s 14 Points It then gives an overview of CMM and compares CMM and ISO9001; The course covers the following topics: Planning for Quality; Software Quality Assurance Activities in the Software Life Cycle; Quality Factors; Quality Metrics; Quality Roles and Responsibilities, Quality Policies and Quality audits. This module is compulsory for all SE students.\r\n\r\nSG5103-2 Software Quality Management Systems\r\nThe objective of this course is to provide an introduction to SQMS and ISO9001:2000. It describes how to conduct a pre-assessment. It then focuses on developing an SQMS. In particular it describes Quality manual development, the quality system framework, life cycle activities, supporting activities,. There is a quality manual development assignment, quality audit assignments and pre-assessment assignments. This module is compulsory for all SE students.\r\n\r\nSG5103-3 Peer Reviews\r\nThe objective of this course is to teach how to perform Peer Reviews. It provides an overview of Peer reviews, and describes Rules, Source Documents and Kin; the Software Inspection Process, and Inspection roles and responsibilities; Software Inspection Defect classifications; Defect Logging, Peer Review Follow-up. There is a peer review assignment. This module is compulsory for all SE students.\r\n\r\nSG5003-4 Software Testing\r\nThe objective of this course is to teach how to effectively test software Topics covered in the course include; Purpose of Testing; Functional and Quality Testing; Testing Techniques; Tool Support for Testing; Success Criteria; Defect Tracking and Defect Cause Analysis. This module is compulsory for all SE students.",
	"CrossModule": "",
	"ModuleCredit": "8",
	"Workload": "3-1-1-9.2-5",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "SG5208",
	"ModuleTitle": "Object Oriented Design Patterns",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "The objectives of this course will be to advance the use of OO design patterns in software development. The course will explain how the use of OO design patterns will improve the transition from Object Oriented analysis to design, and will generally improve Object Oriented implementation. The course will Introduce design patterns, and will show how Design Patterns work using a Case Study. The course will also describe Object Oriented Design Principles and will include Design Pattern Programming Workshops using C++, Java, C#, etc. The course will also cover Web-based Application Patterns and will finally describe the benefits of Design Patterns. There will be a design/programming project. This course is intended for OO designers/developers who wish to use advanced techniques to develop OO systems.",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "1.5-0.5-0.5-3-1.8",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "SG5209",
	"ModuleTitle": "Enterprise Java",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "The aim of this course is to teach students about building Enterprise applications. Design challenges and issues that need to be considered will be discussed. Java 2 Enterprise Edition (J2EE) as a solution to build Enterprise application will be introduced. J2EE is a framework for building robust, secure and scalable applications. It simplifies the development of enterprise applications using servlet, JSP and EJB technologies to create robust and dynamic web applications, build reusable business objects and services that can be shared across the enterprise. This course will also teach how J2EE implements security and transaction features necessary for typical web-based e-commerce applications. There will be a design/programming project. This course is intended for OO designers/developers who wish to develop enterprise Java applications.",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "1.5-0.5-0.5-3-1.8",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "SG5211",
	"ModuleTitle": "Business Process Management",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "This course applies the principles of engineering and management to business processes with the aim of enhancing customer value. Business Process Management (BPM) involves analyzing, automating, deploying, monitoring and maintaining business processes on a continuous basis. Focusing on the criticality of business processes, the course uses BPM as an approach to reduce the gap between business intent and execution. By taking a simulation based approach the course teaches techniques to analyze, design, deploy and digitize business processes. This is further enriched by coverage of industry specific process frameworks. Finally, the role of business processes in the overall services architecture is covered to provide a holistic perspective",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "1.5-0.5-0.5-3-1.8",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "SG5221",
	"ModuleTitle": "Independent Work 2",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "Independent Work 2",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "2-1-1-5-1",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "SG5225",
	"ModuleTitle": "Architecting Software Solutions",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "This course aims to equip the participants with knowledge to build robust, scalable and maintainable software architectures. The participant will get to understand how the solution architecture fits into the broader context of\r\nsoftware development and enterprise architectures of the organization. The syllabus focuses on the understanding of architectural concepts, software qualities such as availability, performance and security and reusing of\r\narchitectural patterns. By combining lectures with scenario based workshops, the participant will apply the patterns and software qualities with respect to Web and middleware architectures.",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "1.5-0.5-0.5-3-2",
	"Prerequisite": "While there is no module pre-requisites, the student is\r\nexpected to have knowledge in the following topics:\r\n- Java (preferred) or .NET Programming\r\n- Object Oriented Design",
	"Preclusion": "NIL",
	"Corequisite": "NIL"
}, {
	"ModuleCode": "SG5228",
	"ModuleTitle": "Digital Innovation and Design",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "The next lap in IT Requirements Engineering will involve emerging Service Models. Such models involve value being co-created with and by both producers as well as consumers of the Service. The concept of value in use replaces the more traditional value in exchange.\r\nHelped by participatory technologies, co-created value may be derived not just from collaboration but also from collective intelligence.\r\nThis module will cover the Service Innovation and Design spectrum from conception through design and implementation with key references to frameworks, models, patterns, methodologies, techniques and best practices. Topics are backed by practice workshops to hone the foundational knowledge and skills for the course.",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "6.5-0-0-10-3",
	"Prerequisite": "NIL",
	"Preclusion": "NIL",
	"Corequisite": "NIL"
}, {
	"ModuleCode": "SG5236",
	"ModuleTitle": "Machine Learning for Software Engineers",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "This course provides a thorough introduction to machine learning, datamining, and statistical pattern recognition. Topics include: \n\n(i) Supervised learning (parametric/non-parametric algorithms, support vector machines, kernels, neural networks).  \n(ii) Unsupervised learning (clustering, dimensionality reduction, recommender systems).  \n(iii) Best practices in machine learning (bias/variance theory; innovation process in machine learning and AI).  \n\nExtensive programming workshops are included.",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "1.5-1.0-0-3.0-2.0",
	"Prerequisite": "Programming skills.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "SG5237",
	"ModuleTitle": "Secure Software Life Cycle",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "NON-FACULTY-BASED DEPARTMENTS",
	"Department": "INSTITUTE OF SYSTEMS SCIENCE",
	"ModuleDescription": "In light of heightened information security concerns, organisations are looking at security as part of software development and lifecycle. Without Security involvement, applications can be developed that create major security exposures. Such security flaws, if discovered late, can result in applications having to be redeveloped, or can force reliance on expensive, inflexible security solutions to be added.\r\n\r\nSecurity education provides application developers knowledge and awareness to avoid developing insecure applications. This course details security measures that must be put in different phases of software lifecycle, from\r\nrequirements, design to acceptance phases as well as deployment maintenance and ultimately disposal.",
	"CrossModule": "",
	"ModuleCredit": "3",
	"Workload": "1.5-0.5-0.5-3-2",
	"Prerequisite": "There are no hard prerequisites in terms of existing courses, but students are expected to have basic knowledge of software development techniques and the software development lifecycle.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YCC1111",
	"ModuleTitle": "Literature and Humanities 1",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This is the first semester of a two semester sequence on literature and humanities.  The sequence explores literature and other arts from cultures around the world throughout history.  Special attention is paid to developing skills in written and oral expression.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "1-3-0-8.5-0",
	"Prerequisite": "NIL",
	"Preclusion": "NIL",
	"Corequisite": "NIL"
}, {
	"ModuleCode": "YCC1113",
	"ModuleTitle": "Philosophy and  Political Thought 1",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This is the first module of a two semester sequence exploring philosophy and political thought. Texts and ideas from many times and many cultures around the world will be explored. Special attention is given to developing skills of oral and written expression.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "1-3-0-8.5-0",
	"Prerequisite": "NIL",
	"Preclusion": "NIL",
	"Corequisite": "NIL"
}, {
	"ModuleCode": "YCC1121",
	"ModuleTitle": "Comparative Social Inquiry",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module explores a range of social institutions from the perspective of a variety of disciplines in the social sciences.  Quantitative and qualitative methods are explored, with examples chosen from societies around the world.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "1-3-0-8.5-0",
	"Prerequisite": "NIL",
	"Preclusion": "NIL",
	"Corequisite": "NIL"
}, {
	"ModuleCode": "YCC1122",
	"ModuleTitle": "Quantitative Reasoning",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module explores a range of quantitative methods in a manner accessible to all students regardless of level of preparation.  Examples are generally chosen from the social sciences, but the methods themselves are applicable to a wide range of topics.  Special attention is paid to helping students develop their skills in presenting and analysing quantitative information.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3.5-0-9.0-0",
	"Prerequisite": "NIL",
	"Preclusion": "NIL",
	"Corequisite": "NIL"
}, {
	"ModuleCode": "YCC1133",
	"ModuleTitle": "Week 7: Experiential Learning Field Trip",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "During Week 7, students, faculty and staff engage in learning projects of up to a week that explore themes of the Common Curriculum in a broader context, in an interdisciplinary way and in a different setting than the traditional classroom. Week 7 takes place half-way through the first semester of the first year. The week culminates in a symposium.",
	"CrossModule": "",
	"ModuleCredit": "0",
	"Workload": "",
	"Prerequisite": "NA",
	"Preclusion": "NA",
	"Corequisite": "NA"
}, {
	"ModuleCode": "YCC2121",
	"ModuleTitle": "Modern Social Thought",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module will introduce students to foundational figures of modern social thought and explore the ways in which their writings have been taken up in contemporary social analysis and political practice in different parts of the world.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "1-3-0-8.5-0",
	"Prerequisite": "YCC1111 Literature and Humanities 1, YCC1112 Literature and Humanities 2, YCC1113 Philosophy and Political Thought 1, YCC1114 Philosophy and Political Thought 2, YCC1121 Comparative Social Institutions, OR permission of instructor",
	"Preclusion": "Not Applicable",
	"Corequisite": "Not Applicable"
}, {
	"ModuleCode": "YCC2137",
	"ModuleTitle": "Scientific Inquiry 2",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Building upon SI1 and QR, SI2 develops deeper understanding and application of scientific modes of inquiry by tackling a topical question in science, e.g. climate change, origins of our universe, artificial intelligence, etc. The semester focuses on a single central question. Students explore related issues in breadth and depth: Breadth from a general introduction to the central question; depth from six weeks on one aspect of their choice. The course ends with a synthesis segment, where students work in teams to put together various elements learned, much as scientific teams today assimilate multi-faceted evidence and solutions to address current problems.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "1-3-0-4-4.5",
	"Prerequisite": "YCC1131 Scientific Inquiry 1 and YCC1122 Quantitative Reasoning",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU2202",
	"ModuleTitle": "Introduction to Creative Nonfiction",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course will introduce students to the practice of creative nonfiction writing. It will explore the genre's manifold forms, including memoir, personal essay, literary journalism, lyric essay, and op-eds. Each week, students will read classic and contemporary examples of creative nonfiction and practise the craft themselves through guided writing exercises. The reading list will include many diaspora, emigrant, and third-culture writers alongside progenitors of the genre, such as Michel de Montaigne and Li Shang-Yin. Students will craft two main essays over the course of the semester, as well as a variety of shorter original pieces.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU2215",
	"ModuleTitle": "Drawing Methods",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module introduces students to the skills and techniques, concepts and practices involved in Contemporary Drawing and exhibition making. Classes will use a range of drawing materials, and include notebook research, fieldtrips, talks and critical presentations. Students will develop a portfolio of drawings through class exercises and with tutorial advice, these will be developed in personal directions and focused themes for a final exhibition.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-6-2.5",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU2248",
	"ModuleTitle": "Introduction to 2D Animation",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course will introduce students to 2D Animation as part of the arts and humanities major Practice category. Students will work with the methods, materials and techniques of 2D animation. Through studio sessions, workshops and talks they will be introduced to the key aspects of 2D Animation and paper cut animation, and become familiar with the techniques and themes involved.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-3-6.5",
	"Prerequisite": "None.",
	"Preclusion": "None.",
	"Corequisite": "None."
}, {
	"ModuleCode": "YHU2268",
	"ModuleTitle": "Money",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "If you have money, you probably think about it a fair bit. And if you don’t have money, you might think about it even more. In this course, we will think about money a lot. In particular, we will examine some central philosophical issues surrounding money and its place in a well-lived life, including its relation to happiness, freedom, and virtue.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-8.5-1",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU2292",
	"ModuleTitle": "Introduction to Writing Poetry",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "As its title implies, this module will introduce students to the art of writing poetry. There will be readings assigned, but this will mainly be a writing module, with weekly writing assignments and peer critiques.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-9.5-0",
	"Prerequisite": "",
	"Preclusion": "YHU1210 (previous module code)",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU2293",
	"ModuleTitle": "Introduction to Fiction Writing",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module will introduce students to the practice of writing fiction, primarily the short story. Students will learn about character development, scene, setting, dialogue and other important elements. Weekly exercises and readings will form a foundation from which students can build their understanding of the craft of fiction.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-6-3.5",
	"Prerequisite": "",
	"Preclusion": "YHU1212",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU2302",
	"ModuleTitle": "Realism and Naturalism",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Realist and naturalist literature came to dominate the nineteenth century and was linked to developments in philosophy, historiography, and various scientific fields, including economics, evolution, and ethnography. This module reads key realist and naturalist works alongside brief contextual selections in order to understand the origins, problems, and continuing importance of a literary mode that purported to deliver reality to its readers. Readings might include Balzac, Brontë, Gaskell, Flaubert, Eliot, Freytag, Zola, Ibsen, Fontane, Galdós, Rizal, Strindberg, Jewett, Dreiser, and Wharton, as well as brief theoretical pieces by Barthes, Watt, Armstrong, and Levine.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-1-8.5",
	"Prerequisite": "YCC1112 Literature and Humanities 2 or with the permission of the instructor.",
	"Preclusion": "None",
	"Corequisite": "None"
}, {
	"ModuleCode": "YHU2305",
	"ModuleTitle": "Bad Love in 20C Literature",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course focuses on twentieth-century narratives from America, Asia, and Europe that explore the \"badness\" of love¿including scandalous behaviour, subversive fantasies, shifting identities, moral and social transgressions. Texts are technicians of desire (its mechanics, frustration, and exploits), wherein sex and love are \"textualised\" that they may escape repression and the difficulties of fulfillment. From Lawrence's sexual realism to Berger's cinematic mélange, this course examines how the extent of \"badness\" is a reflection as well as strategy for expressing concerns and crises around modern life in the fin-de-siècle.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-3-6.5",
	"Prerequisite": "YCC1111 Literature and Humanities 1 and YCC1112 Literature and Humanities 2 or with permission of the instructor",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU2307",
	"ModuleTitle": "History of Crises: Europe's 20th Century",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "History of Crises is an introduction to Europe’s 20th century, including the histories of the First and Second World Wars and communism that still shape contemporary world politics.  The theme that runs through this survey course of that of crisis: we will look at five crisis moments, including the crisis of the First and Second World Wars and 1989. We will analyse primary sources, pamphlets, novels, and secondary literature to provide a transnational understanding of the main social, economic, and political processes that shaped Europe’s 20th century.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-3-6.5",
	"Prerequisite": "None",
	"Preclusion": "NA",
	"Corequisite": "NA"
}, {
	"ModuleCode": "YHU3205",
	"ModuleTitle": "Ming Imperial Voyages",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "From 1405 to 1433, the Ming admiral Zheng He (Cheng Ho) led seven\r\nextravagant expeditions to kingdoms in Southeast Asia and around the Indian\r\nOcean world, going as far as the African continent. In this Historical\r\nImmersion course, we will examine the life of this eunuch-admiral and\r\nexplore the nature of his voyages. We will also study the policies and\r\nambitions of Zheng He’s patron, the Emperor Yongle, and consider his lasting legacy today.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-1.5-8",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU3216",
	"ModuleTitle": "Photojournalism",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course will cover the practicalities of working as a visual journalist in\r\ntoday’s world. The evolving media landscape demands an awareness of the\r\nuses and meanings of images and a high degree of visual literacy. Besides\r\ncovering the technical aspects of camera operation, post production and\r\ndigital delivery, the curriculum will provide opportunity for critique and\r\ndebate both of student’s work and current practitioners in the field. Real world assignments, discussions on ethics, business practices, exploration of\r\nthe potential of new media and visits by guest speakers will all form part of\r\nthe course.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-6-3",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU3221",
	"ModuleTitle": "Nietzsche: An Untimely Thinker and His Times",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "In the 1880s, the German philosopher Friedrich Nietzsche proclaimed the death of God and called for a new life-affirming philosophy to combat the rise of nihilism. Nietzsche, one of the most provocative thinkers of the nineteenth century, lived in an age of cultural tumult and intellectual transformation. This course provides a window into this period through a close engagement with Nietzsche’s writings, including his philosophical works, his personal correspondence, and his autobiography. Attention will also be paid to his friendship and subsequent disillusionment with the composer Richard Wagner.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-9.5-0",
	"Prerequisite": "None.",
	"Preclusion": "None.",
	"Corequisite": "None."
}, {
	"ModuleCode": "YHU3261",
	"ModuleTitle": "Analogical Reasoning and Metaphor",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Einstein imagines a beam of light as a train which he rides. Mengzi thinks of human virtues as growing sprouts. Why is this kind of reasoning so pervasive, and what does it mean to think with metaphor and analogy? Three philosophical traditions will inform our exploration of these questions: Indian philosophy, Chinese philosophy, and contemporary Anglophone analytic philosophy. We will consider what metaphor and analogy are, the implications for understanding their role in our thought, their relationship to culture and language and their importance in philosophical topics such as ethics.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-3-6.5",
	"Prerequisite": "YCC1113 Philosophy and Political Thought 1 and YCC1114 Philosophy and Political Thought 2",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU3265",
	"ModuleTitle": "Philosophy of Religion",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "In this course, we will examine some central philosophical issues concerning religious belief and practice. Topics may include the problem of evil, petitionary prayer, and religious experience; readings will be contemporary but not exclusively Anglophone.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-1-8.5",
	"Prerequisite": "YCC1113 Philosophy and Political Thought 1 and YCC1114 Philosophy and Political Thought 2, or permission of HOS or instructor",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU3266",
	"ModuleTitle": "Democratic Theory",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Why is democracy valuable? What does it even mean to call a political order a democracy? How can democracy represent a 'will of the people' if the people disagree with one other? Does democracy conflict other important values and goals? In this course we answer these questions by first establishing a conceptual framework from the history of political thought, and then plunging into contemporary democratic theory. We will use theory to analyse contemporary local and international examples, and be open to real examples posing challenges to theory. \nThe course satisfies these dimensions of the Philosophy major: Skills, Problems; Historical, New.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "YCC2121 Modern Social Thought",
	"Preclusion": "Precludes previous module code of YHU2245",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU3274",
	"ModuleTitle": "Painting the Orient",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This historical immersion course examines the beginnings and subsequent proliferation of Orientalist painting in the first half of the nineteenth century. Taking Edward Said’s seminal definition of Orientalism as a point of departure, students will investigate the historical processes by which Europeans conceptualized and represented the “Orient” both at the moment of initial colonial encounter and during subsequent imperial expansion. Students will analyze a number of masterpieces of Orientalist painting alongside key literature. Students will engage with different theoretical positions and methodologies, exploring how the legacy of Orientalism continues to influence our perceptions of the East/West binary to this day.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-3-6.5",
	"Prerequisite": "Priority for Juniors and Seniors",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU3276",
	"ModuleTitle": "The Historian’s Craft",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This is a hands-on course in which students will be introduced to the practices involved in historical research, writing, and presentation. Students will be exposed to a variety of models created by professional historians and evaluate the strengths and weaknesses of each. Direct engagement with primary sources will be a principal area of focus in this course.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "All Common Curriculum modules, and at least one 2000 level History module.",
	"Preclusion": "Precludes previous module code of YHU2217",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU3286",
	"ModuleTitle": "Living & Dying in War: Kuo Pao Kun’s The Spirits Play",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "In Kuo Pao Kun’s The Spirits Play, five Japanese spirits - a General, a\nSoldier, a Mother, a Nurse and a Poet - recall their life during World War\nII. In this module, students will study Japan’s national mobilisation for\nthe war, and the daily life experience of those mobilised, by researching\nand examining a wide range of primary (e.g. oral history, propaganda\nfilms), secondary and cultural materials. Students will analyse and\ndiscuss Kuo’s portrayal of war-time experience with reference to\nmaterials they have gathered. In addition, students will create a short\nperformance/creative work from these materials.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "All Common Curriculum modules in the first two years.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU3288",
	"ModuleTitle": "Installation Art",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The course will give students the opportunity to engage with space and place from a creative perspective. Approaches including site-specific, environmental art, ephemeral media, and other alternative methods will be explored. While making art ecological and social issues will be investigated while investigating alternative methods of exhibition. Students will gain familiarity with multiple uses of space in the practice of installation art. Students will draw upon basic visual media while learning to utilize new media, natural materials, sculpture, video and other media. The aim of this course is to develop one’s own language for expression that is sensitive to space.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-3-6.5",
	"Prerequisite": "Nil",
	"Preclusion": "None",
	"Corequisite": "None"
}, {
	"ModuleCode": "YHU3289",
	"ModuleTitle": "Beyond China: Sinophone Literature, Film, and Culture",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "“China” and “Chinese” are no longer adequate terms for the study of Sinitic-language communities and cultures that evince politically tenuous and linguistically polyphonic relations with the People’s Republic of China. This course interrogates Sinophone Studies as a critical, interdisciplinary alternative to previous constructions of Chinese literature and culture tied to the nation-state and progressive narratives of modernity. Students will study fiction and films from Hong Kong, Malaysia, Singapore, Taiwan, the United States, and the PRC, along with critical works explaining the ways that diaspora, colonialism, comparative empires, and ethnic or minority studies have informed the rise of Sinophone Studies.\n\nAll Chinese-language materials will be read in English translation.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-2.5-7",
	"Prerequisite": "YCC1111 Literature and Humanities 1 & YCC1112 Literature and Humanities 2",
	"Preclusion": "NIL",
	"Corequisite": "NIL"
}, {
	"ModuleCode": "YHU3291",
	"ModuleTitle": "Sacrifice, Sex, and Power in Medieval Kashmir",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Kashmir became an important centre of philosophy, religion and literature in the early medieval period (850-1050), with Buddhism and different kinds of Hinduism vying with each other for royal patronage. Orthodox Brahmins performed sacrifice and practiced ritual purity, Buddhism cultivated inner purity of the mind that leads to salvation (nirva¿a), while new forms of Hinduism called Tantra rejected ritual purity in the belief that impurity – such as ritual sex outside caste – leads to power and success. This course will examine these concerns by focusing on a play, Much Ado About Religion, and a philosophical text, The Essence of Supreme Truth.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-3.5-6",
	"Prerequisite": "None but priority will be given to Juniors and Seniors.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU3293",
	"ModuleTitle": "Japanese Woodblock Prints",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module will thoroughly examine Japan’s most celebrated artistic medium from the mid-17th century to the modern era. Along with close studies of technological developments, major genres, and master printmakers, the module will explore complex issues of urban culture, print capitalism, censorship, representation of war and national identity, gender roles, and portrayals of modernization.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "",
	"Preclusion": "YHU1211 (previous module code)",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU3311",
	"ModuleTitle": "Ancient Tragedy: Gender, Politics, and Poetry",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Why does tragedy exist as a dramatic form and what does it say about gender and mortality? How did audiences and authors participate in this form of performance in ancient Athens? How did philosophers and literary theorists understand the genre in antiquity, and what theoretical approaches are relevant today? What was the social and political context of tragedy, and how did the plays comment on contemporary and transcendent concerns? Students will read tragedies and para-tragic works such as comedy from 5th C Athens, as well as Roman tragedies and contemporary literature that responds to the Greek tradition.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "YCC1111 Literature and Humanities 1 and\nYCC1112 Literature and Humanities 2 or\nwith the permission of the instructor",
	"Preclusion": "None",
	"Corequisite": "None"
}, {
	"ModuleCode": "YHU3313",
	"ModuleTitle": "The Amarna Letters: Diplomacy in the Late Bronze Age",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course focuses on a corpus of 349 diplomatic letters written in cuneiform script on clay tablets which was unearthed in 1887 at Amarna, the short-lived capital of Egypt in the mid-14th century BCE. The letters addressed to the pharaoh Akhenaten by peers and vassals alike are written in Akkadian, a Mesopotamian language which served as the diplomatic lingua franca of the Late Bronze Age Middle East and the eastern Mediterranean. We will examine, with the aid of the Amarna corpus, the Late Bronze Age “international” system with especial attention on laws, diplomatic regimes, intelligence activities and conflict resolution.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-0-9",
	"Prerequisite": "NA",
	"Preclusion": "NA",
	"Corequisite": "NA"
}, {
	"ModuleCode": "YHU3314",
	"ModuleTitle": "1989: The End of the Cold War",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course on the global history of 1989 provides an in-depth understanding of rapid historical change. Within a matter of few months, the Soviet empire collapsed, seemingly out of the blue, precipitating changes in America, Eastern Europe, China, and beyond. Why do empires crumble and how do ordinary people react? What caused this momentous historical change: savvy diplomats, philosophers, shortage of natural resources, or movements of civil society? We will study transcripts of Soviet party leadership meetings, trials of communist dictators, and secondary literature with a global reach to make sense of the end of the Cold War.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-3-6.5",
	"Prerequisite": "None",
	"Preclusion": "N/A",
	"Corequisite": "N/A"
}, {
	"ModuleCode": "YHU3315",
	"ModuleTitle": "Gospels as Literature",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The Gospels have shaped not only Christianity and Western culture but also world history itself. This is not a course on apologetics, we will rather apply the tools of literary criticism to the stories about the life, death, and resurrection of a man named Jesus who became Christ. We will examine the formation of the New Testament as canon, its relationship to the Hebrew bible, Canaanite literature, Hellenistic and Roman writing, the genres of the parable, aphorisms, and sermons. We will also read texts that were deemed heretical, such as the Gospels of Thomas, Truth, Mary and Judas.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "YCC1111 Literature and Humanities 1 and\nYCC1112 Literature and Humanities 2 and at least one non-Common Curriculum course in the humanities.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU3316",
	"ModuleTitle": "Singapore under Japanese Occupation",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The histories of Singapore and the Japanese Empire collided in 1942, when a Japanese army captured the city and renamed it Syonan, the “Light of the South.” For three-and-a-half years, Syonan served as the “nerve centre” of Japanese-controlled Southeast Asia, and the occupation experience transformed the lives of local residents. The historical record of the occupation is incomplete, however, and to understand it historians must use all the methodological tools at their disposal. This course provides an in-depth study of war and occupation in Singapore, as well as an introduction to the complex task of understanding the recent past.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3(2x1.5)-0-3-6.5",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU3318",
	"ModuleTitle": "The History of Sexuality in Modern Europe",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course focuses on the history of sexuality in modern Europe, from the Enlightenment to the early 21st century. It offers an exploration of human sexuality not as a universal constant, but as a socio-discursive construction, moulded and remoulded by historical change. After engaging with some of the critical debates about sexuality’s history that have shaped the field, the course will move on to explore a range of important themes that trace the trajectory through which sexuality has helped to model the contours, identities and fears of modern Europe.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "At least one History module, or with permission from the instructor.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU4101",
	"ModuleTitle": "History Capstone Project",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The History Capstone Project is a year-long 10-MC module, straddling over two semesters. It is a compulsory module that students in the History major must complete in order to graduate. It allows students the opportunity to pursue, in depth, an advanced project of their own choosing, while working closely with a faculty supervisor. Students will work on an advanced creative and/or research or experiential project that integrates skills from the Common Curriculum and learning in the major. The Capstone Project will culminate in a substantial piece of work that reflects a deep engagement with the topic.",
	"CrossModule": "",
	"ModuleCredit": "10",
	"Workload": "0-3-0-4-5.5",
	"Prerequisite": "Completion of all Year 1 and 2 Common Curriculum Modules",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU4102",
	"ModuleTitle": "Literature Capstone Project",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The Literature Capstone Project is a year-long 10-MC module, straddling over two semesters. It is a compulsory module that students in the Literature major must complete in order to graduate. It allows students the opportunity to pursue, in depth, an advanced project of their own choosing, while working closely with a faculty supervisor. Students will work on an advanced creative and/or research or experiential project that integrates skills from the Common Curriculum and learning in the major. The Capstone Project will culminate in a substantial piece of work that reflects a deep engagement with the topic.",
	"CrossModule": "",
	"ModuleCredit": "10",
	"Workload": "0-3-0-4-5.5",
	"Prerequisite": "Completion of all Year 1 and 2 Common Curriculum Modules",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU4103",
	"ModuleTitle": "Philosophy Capstone Project",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The Philosophy Capstone Project is a year-long 10-MC module, straddling over two semesters. It is a compulsory module that students in the Philosophy major must complete in order to graduate. It allows students the opportunity to pursue, in depth, an advanced project of their own choosing, while working closely with a faculty supervisor. Students will work on an advanced creative and/or research or experiential project that integrates skills from the Common Curriculum and learning in the major. The Capstone Project will culminate in a substantial piece of work that reflects a deep engagement with the topic.",
	"CrossModule": "",
	"ModuleCredit": "10",
	"Workload": "0-3-0-4-5.5",
	"Prerequisite": "Completion of all Year 1 and 2 Common Curriculum Modules",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU4104",
	"ModuleTitle": "Arts and Humanities Capstone Project",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "A capstone research project in this major can take different forms, depending on the student’s area of focus. This module supports the implementation of the capstone project through the development of self-regulated research excellence. Arts and Humanities students will pursue their research, construct creative works, and consider methodological issues together to critique and improve each other's written work in a seminar setting. Over the 13 weeks, students will fine-tune research skills as well as oral and written communication skills collaboratively. Experts from The Writers’ Centre, the Library, Arts Spaces and CIPE will also enhance the module.",
	"CrossModule": "",
	"ModuleCredit": "10",
	"Workload": "0-2-0-5-5.5",
	"Prerequisite": "Completion of all Year 1 and 2 Common Curriculum Modules",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU4206",
	"ModuleTitle": "The History of History",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Practitioners of every discipline benefit from having an understanding of their discipline’s history. This is especially true for historians, whose work demands an acquaintance with the history of the writing practices and the modes of conceptualizing the past to which they are heirs. Through an engagement with foundational texts from the eighteenth century to the present, this course explores the emergence and development of modern historiography. Students will learn about the diverse ways in which the past has been represented, narrated, and interpreted; they will also examine how historians’ interpretations of the past are themselves imbedded in specific historical contexts.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "None but open to Juniors and Seniors only. Priority will be given to students in the History major/minor.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU4207",
	"ModuleTitle": "Critical Approaches to Art History",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course is designed as an introduction to the analysis of art as a historical and critical discipline. It is at once historiographical, methodological and theoretical and examines the different approaches that scholars and critics have adopted over the centuries to understand and interpret various artworks. Through a wide range of both classical and current texts, students will acquire the fundamental tools with which to approach the visual arts.\r\n\r\nThe course is specifically aimed at students, who are planning to pursue an\r\nart historical topic as part of their senior capstone project in the Arts and\r\nHumanities Major.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-4-5.5",
	"Prerequisite": "Completed Common Curriculum & at least one level 1000 or 2000 art history course (from:YHU2300,YHU2203,YHU2250,YHU4208,YHU4210,YHU2255,YHU3239,YHU3242,YHU2267,YHU3274,YHU4221, YHU3293,YHU4230,YHU4238,YHU2227,YHU3235,YHU3236,YHU2262,YHU3251,YHU3254,YHU3218,YHU1201, YSH2448,AH2101,AH2201,AH2202,AH3204,AH2203,AH3201,CH2293,CH3293,EN3249,SE3210).",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU4214",
	"ModuleTitle": "Advanced Creative Nonfiction",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Advanced Creative Nonfiction will delve into long readings and the creation of original true stories. Students will grapple with landmark books of creative nonfiction, write and revise their own long nonfiction pieces, and deepen their engagement with the different forms inside the genre. This module fulfills the Creative Writing track in the Arts & Humanities major.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-6.5-3",
	"Prerequisite": "YHU2202 Introduction to Creative Nonfiction, OR entrance into this course requires submission of a portfolio of one or two examples of creative nonfiction of no more than 3000 words combined.",
	"Preclusion": "YHU3206 (previous module code)",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU4217",
	"ModuleTitle": "Novel Evidence:19th-Century British Fiction and the Law",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course examines the relationship between British fiction and ideas of evidence in the 19th century. Readings are drawn primarily from novels by Austen, Scott, Shelley, Collins, Trollope, Eliot, and Doyle; excerpted 18th- and 19th-century treatises on evidence law; philosophers of British empiricism like Locke and Hume; Victorian court reports; and theories of law and literature.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-2-7.5",
	"Prerequisite": "YCC1111 Literature and Humanities 1 and YCC1112 Literature and Humanities 2",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU4240",
	"ModuleTitle": "American Modernist Poetry",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module provides an opportunity for a detailed study of the\ninterface between American poetry of the first half of the 20th century\nand the concept of literary modernism. A close reading of selections\nfrom six major poets will address the following questions: How and\nwhy did the major poets of America dominate Western literary culture?\nWhat was the unique nature of their contribution to the many ideas\nand practices that go under the name of Modernism? What are the\ncreative possibilities they explored, whose influence continues to\ndominate global writing in English in the 21st century?",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-3-6.5",
	"Prerequisite": "YCC1111 Literature and Humanities 1 AND YCC1112 Literature and\nHumanities 2, AND at least one module for the Literature major at 2000\nlevel and one at 3000 level OR with the permission of the instructor.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YHU4248",
	"ModuleTitle": "Adapting Shakespeare",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course explores approaches to adapting and staging of Shakespeare for contemporary audience to develop an understanding of the creative processes and implications involved. Through seminar discussions and practical creative work, we will examine creative, cultural and ethical implications of returning, repeating, rewriting, reinterpreting and representing. Selected contemporary performances of Shakespeare will be studied in the first part of the course to provide a basis for critical discussion and creative referencing. Students will then produce a creative proposal based on a selected Shakespeare play, for which they will rework for presentation towards the end of the course.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "New 2000 level course on Thinking about Performance Making. Or at least one theatre related module from the following: YHU2275 Creating and Performing a Character (previously titled Implicit Body Explicit Action); YHU3301 Creating and Performing Comedy; YHU3286 Living & Dying in War: Kuo Pao Kun’s The Spirits Play; Or with the permission of the instructor.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YID1201",
	"ModuleTitle": "Introduction to Environmental Studies",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module introduces students to the field of environmental studies.  We explore the core concerns of the field, its history, its primary methods of analysis, and a number of pressing environmental challenges to human well-being.  We also examine how insights from the humanities, the social sciences, and the natural sciences can be integrated to analyze environmental problems and generate responses to them.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-5.5-4",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YID2201",
	"ModuleTitle": "Theory and Practice of Environmental Policymaking",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "An introduction to the tools, methods, and theory of effective environmental policymaking at the local, national, regional, and global level, with primary\r\nfocus on governmental policies. Students will explore the interplay of politics and policy to develop an understanding of the drivers of successful environmental policymaking from a comparative perspective. This course is a prerequisite for subsequent environmental-studies policy and policymaking courses.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-4.5-5",
	"Prerequisite": "YID1201 (Introduction to Environmental Studies), or permission of instructor",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YID2207",
	"ModuleTitle": "Social Theory and the Environment",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This foundational module in environmental studies introduces students to social theories applicable to socio-ecological problems. It equips students with the theoretical knowledge for social scientific analysis expected in upper-level environmental studies courses and the capstone project. As an interdisciplinary module, students will be introduced to concepts and theories in environmental sociology, environmental anthropology, political ecology, and science and technology studies, among others.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-3-6.5",
	"Prerequisite": "YCC2121 Modern Social Thought, and YID1201 Introduction to Environmental Studies",
	"Preclusion": "",
	"Corequisite": "YID1201 Introduction to Environmental Studies"
}, {
	"ModuleCode": "YID2209",
	"ModuleTitle": "Biogeophysical Systems",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "To better understand the effects humans are having on the Earth, this course explores how the Earth functions as a complex system with a solid lithosphere interacting with an atmosphere and hydrosphere in a way that sustains the biosphere. We investigate how these different spheres interact, and how scientists measure the changes in these realms. Topics include the theory of plate tectonics, the dynamics of atmospheric circulation, and the fundamentals of biogeochemical cycling as the foundation of ecosystems. Students will engage in data collection and analysis, and compare their analyses to current knowledge as documented in the scientific literature.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "1-2-0-3-6.5",
	"Prerequisite": "YID1201 Introduction to Environmental Studies as a prerequisite or as a co-requisite, or permission of the instructor.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YID3201",
	"ModuleTitle": "Conservation Biology",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "An introduction to the principles of conservation biology, including\r\npopulation, community, and ecosystem-level approaches. Students will learn\r\nthe basics of ecology and population genetics as they pertain to\r\nconservation, interrogate classic case studies in the field, and explore\r\nrelevant examples from around Southeast Asia.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-4.5-5",
	"Prerequisite": "YCC2135 Foundations of Science (Class of 2019) or YCC2132 Foundations of Science 2 (Class of 2018) or YCC2137 Scientific Inquiry 2 (Class of 2020 onwards) or YCC2134 Integrated Science 3 or with permission of the instructor.",
	"Preclusion": "",
	"Corequisite": "YCC2137 Scientific Inquiry 2 (Class of 2020 onwards)"
}, {
	"ModuleCode": "YID3214",
	"ModuleTitle": "Urban Ecological Systems",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "With an increasingly urbanised human population the interaction of nature with the built environment and its human inhabitants is emerging as one of the greatest sources of both opportunity and inertia to goals of sustainability. In this course you will consider the extent to which urbanisation has changed natural ecosystems and led to the rise of a new urban ecology, and consider how humans can value and manage this in a socio-ecological context. We will then address how the confluence of climate change, globalisation and urbanisation are fundamentally altering our living space and the implications for human health and wellness.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-2-7.5",
	"Prerequisite": "One module in environmental studies OR one module in urban studies OR permission of the instructor",
	"Preclusion": "YSS3272 Urban Ecological Systems (previous code)",
	"Corequisite": ""
}, {
	"ModuleCode": "YID4101",
	"ModuleTitle": "Environmental Studies Capstone Project",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The Environmental Studies Capstone Project is a year-long 10-MC module, straddling over two semesters. It is a compulsory module that students in the Environmental Studies major must complete in order to graduate. It allows students the opportunity to pursue, in depth, an advanced project of their own choosing, while working closely with a faculty supervisor. Students will work on an advanced creative and/or research or experiential project that integrates skills from the Common Curriculum and learning in the major. The Capstone Project will culminate in a substantial piece of work that reflects a deep engagement with the topic.",
	"CrossModule": "",
	"ModuleCredit": "10",
	"Workload": "0-1.5-0-5-6",
	"Prerequisite": "Completion of all Year 1 and 2 Common Curriculum Modules",
	"Preclusion": "None",
	"Corequisite": "None"
}, {
	"ModuleCode": "YID4202",
	"ModuleTitle": "Applied Environmental Research",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The seminar, restricted to environmental-studies majors, is an applied, interdisciplinary exploration of a contemporary environmental challenge. Students conduct research, perform necessary analysis, and present their findings to relevant stakeholders. The seminar heightens students’ ability to conceptualise and analyse knotty problems, fosters an ability to communicate effectively across disciplines, and develops research skills for the capstone project. The module is offered in semester one of each academic year and is required of all 3rd-year environmental-studies majors. Fourth-year majors will be admitted only under unusual circumstances (e.g. declaring the major late or an urgent need to study away in semester one of a student’s third year), subject to approval by the Head of Studies.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-3-6.5",
	"Prerequisite": "Open only to Environmental Studies majors, and required for all 3rd-year majors in the program. The course is offered only during Semester One of each academic year.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YIL1201S",
	"ModuleTitle": "Directed Language Study: Beginning Sanskrit",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course offers four hours a week of language instruction in Sanskrit for beginners. Instruction will cover the writing systems, vocabulary, and syntax of classical Sanskrit texts. Students will achieve a basic reading level by the end of the semester. The course will be taught via teleconference.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-0-8.5",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YIL1202I",
	"ModuleTitle": "Directed Language Study: Beginning Italian 2",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Beginning Italian 2 is a continuation of Beginning Italian 1 and builds upon what students learned in their first semester. It is designed to help students expand their basic ability to read, write, understand, and speak Italian as well as to deepen their cultural competency. Stress will be placed on the acquisition of basic structures, which will be developed and reinforced in subsequent modules. The course will be conducted in Italian via teleconference from Yale.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-3",
	"Prerequisite": "YIL1201I Directed Language Study: Beginning Italian 1 or permission of the Language Coordinator",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YIR3311",
	"ModuleTitle": "Independent Reading and Research",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Independent study in an area of special interest to the student(s), with the close guidance of a faculty member, leading to a final project/product.",
	"CrossModule": "",
	"ModuleCredit": "2",
	"Workload": "0-1-0-4-0",
	"Prerequisite": "Nil",
	"Preclusion": "Nil",
	"Corequisite": "Nil"
}, {
	"ModuleCode": "YIR3311G",
	"ModuleTitle": "Independent Reading and Research",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Independent study in an area of special interest to the student(s), with the\nclose guidance of a faculty member, leading to a final project/product.",
	"CrossModule": "",
	"ModuleCredit": "2",
	"Workload": "0-1-0-4-0",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YIR3312",
	"ModuleTitle": "Independent Reading and Research",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Independent study in an area of special interest to the student(s), with the close guidance of a faculty member, leading to a final project/product.",
	"CrossModule": "",
	"ModuleCredit": "2",
	"Workload": "0-1-0-4-0",
	"Prerequisite": "Nil",
	"Preclusion": "Nil",
	"Corequisite": "Nil"
}, {
	"ModuleCode": "YIR3312G",
	"ModuleTitle": "Independent Reading and Research",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Independent study in an area of special interest to the student(s), with the\nclose guidance of a faculty member, leading to a final project/product.",
	"CrossModule": "",
	"ModuleCredit": "2",
	"Workload": "0-1-0-4-0",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YIR3313",
	"ModuleTitle": "Independent Reading and Research",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Independent study in an area of special interest to the student(s), with the\nclose guidance of a faculty member, leading to a final project/product.",
	"CrossModule": "",
	"ModuleCredit": "2",
	"Workload": "0-1-0-4-0",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YIR3313G",
	"ModuleTitle": "Independent Reading and Research",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Independent study in an area of special interest to the student(s), with the\nclose guidance of a faculty member, leading to a final project/product.",
	"CrossModule": "",
	"ModuleCredit": "2",
	"Workload": "0-1-0-4-0",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YIR3411",
	"ModuleTitle": "Independent Language Study and Research",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module is intended for an individual or small group of students –\nordinarily 1-2 students– who would like to work with texts and other\nmaterials in a language other than English. Students should clearly\narticulate the goals of their project and what they aim to achieve by\nthe end of the semester. ILSR projects should go beyond reading the\nassigned materials from another course in their original language.",
	"CrossModule": "",
	"ModuleCredit": "2",
	"Workload": "0-1-0-4-0",
	"Prerequisite": "Project proposal with consent of Faculty Supervisor, Language\nCoordinator, Divisional Director, Vice Rector and Dean of Faculty.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YIR3411G",
	"ModuleTitle": "Independent Language Study and Research",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module is intended for an individual or small group of students –\nordinarily 1-2 students– who would like to work with texts and other\nmaterials in a language other than English. Students should clearly\narticulate the goals of their project and what they aim to achieve by\nthe end of the semester. ILSR projects should go beyond reading the\nassigned materials from another course in their original language.",
	"CrossModule": "",
	"ModuleCredit": "2",
	"Workload": "0-1-0-4-0",
	"Prerequisite": "Project proposal with consent of Faculty Supervisor, Language\nCoordinator, Divisional Director, Vice Rector and Dean of Faculty.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YIR3412",
	"ModuleTitle": "Independent Language Study and Research",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module is intended for an individual or small group of students –\nordinarily 1-2 students– who would like to work with texts and other\nmaterials in a language other than English. Students should clearly\narticulate the goals of their project and what they aim to achieve by\nthe end of the semester. ILSR projects should go beyond reading the\nassigned materials from another course in their original language.",
	"CrossModule": "",
	"ModuleCredit": "2",
	"Workload": "0-1-0-4-0",
	"Prerequisite": "Project proposal with consent of Faculty Supervisor, Language\nCoordinator, Divisional Director, Vice Rector and Dean of Faculty.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YIR3412G",
	"ModuleTitle": "Independent Language Study and Research",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module is intended for an individual or small group of students –\nordinarily 1-2 students– who would like to work with texts and other\nmaterials in a language other than English. Students should clearly\narticulate the goals of their project and what they aim to achieve by\nthe end of the semester. ILSR projects should go beyond reading the\nassigned materials from another course in their original language.",
	"CrossModule": "",
	"ModuleCredit": "2",
	"Workload": "0-1-0-4-0",
	"Prerequisite": "Project proposal with consent of Faculty Supervisor, Language\nCoordinator, Divisional Director, Vice Rector and Dean of Faculty.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YLC1202",
	"ModuleTitle": "Beginning Chinese 2",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module is designed for 1) students who already possess some proficiency in spoken Chinese but no formal education in Chinese; 2) students returning from summer study abroad programs; and 3) non-heritage students with prior coursework in Chinese who wish to further develop their reading and writing skills in Chinese. Students will take a placement test prior to the beginning of the course.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-0-6",
	"Prerequisite": "YLC1201 Beginning Chinese 1 or equivalent (an interview or placement test may be administered.)",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YLC2202",
	"ModuleTitle": "Intermediate Chinese 2",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course is designed for students who completed Intermediate Chinese 1\r\n(YLC2201) or have equivalent Chinese proficiency. It emphasizes the ability to\r\ncommunicate and function accurately and appropriately in Modern Chinese.\r\nStudents will take a placement test prior to the beginning of the course. The\r\ncourse aims for students to: (1) acquire basic knowledge and communicative\r\nskills in speaking, listening, reading, and writing Chinese; (2) gain solid understanding of the cultural and social context of Chinese; (3) develop\r\nresearch skill to understand Chinese texts and culture by using Chinese input\r\nsystem and online dictionary, as well as useful online resources.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-2-6.5",
	"Prerequisite": "YLC2201 Intermediate Chinese 1 or students who passed GCE Chinese O & A Levels (an interview or placement test may be administered.)",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YLC3204",
	"ModuleTitle": "Advanced Chinese 2",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The course is the continuation of Advanced Chinese 1 and prepares students to take further courses in advanced-level Chinese. It is designed for students who have studied at least two-and-a-half years of Chinese at the college level to achieve greater proficiency in oral and written uses of modern Mandarin. The course further develop language skills in listening, speaking, reading, and writing, with particular emphasis on enhancing reading and writing abilities. It builds upon the foundations of Advanced Chinese 1 yet differs in giving the students increased exposure to authentic written (and audio-visual) materials not specifically designed for classroom learning.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-2-6.5",
	"Prerequisite": "YLC3203 Advanced Chinese 1 or students who passed GCE Chinese O & A Levels (an interview or placement test may be administered.)",
	"Preclusion": "None",
	"Corequisite": "None"
}, {
	"ModuleCode": "YLC3206",
	"ModuleTitle": "Advanced Chinese: Readings in Modern Chinese Literature",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course is designed to promote the development of critical Chinese reading and writing skills. It aims to further improve the students’ Mandarin Chinese skills in all aspects. Students will gain access to the essence of Chinese culture as well as the charm of the language itself through notable works of modern Chinese literature. They will be introduced to significant topics concerning Chinese culture and history written in different styles and genres. Most of the texts are original and unabridged written by well-known authors such as Yuan Qiongqiong from Taiwan; Xixi from Hong Kong and Mo Yan from mainland China.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-2-6.5",
	"Prerequisite": "YLC3204 Advanced Chinese 2 or students who passed GCE Chinese A Levels (an interview or placement test may be administered.)",
	"Preclusion": "Students who took the old YLC3202 Advanced Chinese: Readings in Modern Chinese Literature in AY2016-17 ONLY cannot take this course",
	"Corequisite": ""
}, {
	"ModuleCode": "YLG1201",
	"ModuleTitle": "Beginning Ancient Greek",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This is an introductory course of language instruction in ancient Attic Greek for beginners, designed to give students a decent reading level by the end of the semester. It offers four days a week instruction. As well as gaining an introductory familiarity with the syntax and vocabulary of ancient Greek texts, students will develop an associated cultural knowledge in ancient Greek society and literary/ dramatic production.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-0-8.5",
	"Prerequisite": "Nil",
	"Preclusion": "Students who have successfully completed YLG2201 Intensive Elementary\nGreek are not eligible for this course.",
	"Corequisite": "Nil"
}, {
	"ModuleCode": "YLG3201",
	"ModuleTitle": "Advanced Ancient Greek Prose",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course is designed to give students a familiarity with a fuller range of the more complex grammar of ancient Greek, and to give them an opportunity to read in a more focused manner specific examples of non-adapted ancient Greek texts in the original. This course will focus on Greek prose; possible authors may include selections from Herodotus, Lysias, Thucydides, or Plato with appropriate commentaries and secondary literature. As well as gaining a deeper understanding of the syntax, grammar, and the different dialects of ancient Greek, students will develop an increased cultural knowledge in ancient Greek society and historical and philosophical concerns of the period.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-1-8.5",
	"Prerequisite": "YLG2202 Intermediate Classical Greek",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YLL2201",
	"ModuleTitle": "Intermediate Latin",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This intensive course offers four days a week of language instruction and follows on from Beginning Latin. Students will continue developing linguistic and cultural knowledge in ancient Mediterranean antiquity, and achieve a relatively strong reading level by the end of the semester.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-0-8.5",
	"Prerequisite": "YLL1201 Beginning Latin or equivalent",
	"Preclusion": "Students who have successfully completed YLL1202 Introduction to Latin 2 or YLL2202 Intermediate Latin are not eligible for this course as  YLL1202 and YLL2202 are previous module codes for this same course.",
	"Corequisite": ""
}, {
	"ModuleCode": "YLS1201",
	"ModuleTitle": "Beginning Spanish 1",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Beginning Spanish 1 is the introductory module to the language and culture of the Hispanic world. This course is designed to help you develop a basic ability to read, write, understand, and speak Spanish as well as to expand students' cultural competency. Since all linguistic skills cannot be fully developed in Beginning Spanish 1 alone, stress will be placed on the acquisition of basic structures, which will be developed and reinforced in subsequent modules.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-3-3",
	"Prerequisite": "No prior knowledge of the language or instructor's approval. A placement exam may be required.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YLS1202",
	"ModuleTitle": "Beginning Spanish 2",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module is a continuation of Beginning Spanish 1. Beginning Spanish 2 pays close attention to aural/oral practice while strengthening basic grammar skills, writing, and reading comprehension. The module covers the second half of the eBook used in Beginning Spanish 1 and prepares students for Study Abroad opportunities via CIPE in their second summer at Yale-NUS or beyond.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-0-6",
	"Prerequisite": "YLS1201 Beginning Spanish 1 or instructor's approval. A placement exam may be required.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YLS2201",
	"ModuleTitle": "Intermediate Spanish 1",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module targets students who have completed the Beginning Spanish sequence or have had significant experience with the language (e.g., Study Abroad during their first summer at Yale-NUS or studied Spanish in high school). It offers a combination of listening and speaking practice with a review of key concepts of Spanish grammar via targeted reading and writing activities. This module continues to incorporate Hispanic cultural elements through representative texts and audiovisual materials from the Spanish-speaking world.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-0-6",
	"Prerequisite": "YLS1202 Beginning Spanish 2 or instructor's approval. A placement exam may be required.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YLS2202",
	"ModuleTitle": "Intermediate Spanish 2",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module is a continuation of Intermediate Spanish 1. Students taking this module will build upon what was covered in the first half and continue to expand their command of written and spoken Spanish. Intermediate Spanish 2 pays close attention to aural/oral practice while strengthening more complex grammar skills (e.g., the subjunctive, passive voice), writing, and reading comprehension. The module covers the second half of the eBook used in Intermediate Spanish 1 (Mas) and prepares students for Study Abroad opportunities via CIPE at Yale-NUS and NUS.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-0-6",
	"Prerequisite": "YLS2201 Intermediate Spanish 1 or instructor’s approval. A placement exam may be required.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YLS3202",
	"ModuleTitle": "Advanced Spanish: Latin America, Borders and Identities",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Students taking this module will build upon the material and topics covered in the beginning and intermediate sequences to expand their command of written and spoken Spanish while honing their literary analysis skills. The course will focus on a representative selection of texts (e.g., short stories, novellas, films) from several Latin American countries. This course will address questions such as: What is the Spanish legacy in Latin America? What issues have these countries dealt with over their recent history? How are these issues portrayed in their literature and films? What are the differences and commonalities across countries? Students will analyze and contextualize these works via in-class discussions and presentations on the history, traditions, and ideas embedded within them. This module will emphasize students' engagement with the ideas in the texts paying attention to stylistics, genre, and voice in their work.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-2.5-6",
	"Prerequisite": "Successful completion of YLS2202 Intermediate Spanish 2 or instructor’s permission.\r\nA placement exam may be required. High intermediate proficiency level as shown via placement exam or through interview with instructor.",
	"Preclusion": "",
	"Corequisite": "N/A"
}, {
	"ModuleCode": "YSC1212",
	"ModuleTitle": "Introduction to Computer Science",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Computer science has improved human life dramatically in the last 50\nyears. This course explains how computational tasks are solved and\ncomputers are programmed. You will learn how to be a more careful and\nmethodical thinker. Moreover, millions of people around the world enjoy\nprogramming and you can too!",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-5-4.5",
	"Prerequisite": "YCC1122 Quantitative Reasoning",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSC1213",
	"ModuleTitle": "General Physics: Electronics and Non-Linear Dynamics",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This introductory physics course uses the platform of hands-on\nelectronics to introduce students to concepts in electro-magnetism\nincluding electrostatics and electrodynamics. Using electronic\ncomponents to build linear and non-linear oscillators, students will be\nintroduced to concepts in nonlinear dynamics and chaos theory. The\ncourse is intended for both science majors and also non-majors.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-1.5-3-0-8",
	"Prerequisite": "High-school courses similar to AP physics and AP mathematics",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSC1216",
	"ModuleTitle": "Calculus of a Single Variable",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Calculus unites the study of instantaneous rates of change, area and optimisation, via the mathematical concepts of limit and infinity. This module provides a conceptual framework for Calculus. We eschew full mathematical rigour, but emphasise real world phenomena more than the rote formal calculations that make up a typical high school Calculus class.\n\nThis module is suitable not only for those who have never learned Calculus before, but also for those who have completed a high school Calculus course. Students completing the module will be prepared for discipline-specific classes in the Sciences and Social Sciences which make use of Calculus.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-3-5.5",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSC2209",
	"ModuleTitle": "Proof",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Mathematicians and computer scientists write proofs: convincing arguments,\r\ncombining clear and concise language, computations and symbolic manipulation, illustrations and tables. By reading, writing, and revising proofs, students will be prepared for modern topics in analysis, algebra, geometry, and theoretical computer science.\r\n\r\nStudents will write proofs that utilize direct deduction and proof by contradiction,\r\ncomplicated logical structures with cases, and mathematical induction. Students will acquire a thorough knowledge of naïve set theory, including sets and functions, equivalence relations and classes, cardinal and ordinal arithmetic. Topics in discrete mathematics will include the combinatorics of finite structures such as graphs and trees.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-4.5-4",
	"Prerequisite": "",
	"Preclusion": "YSC1203 (previous module code for Proof)",
	"Corequisite": ""
}, {
	"ModuleCode": "YSC2216",
	"ModuleTitle": "Evolutionary Biology",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course aims to explore the study of biological evolution from a\nscientific standpoint. It covers topics such as population genetics,\nquantitative genetics and genomics, analysis of adaptation within and\namong species, phylogenetic analysis, and macroevolutionary patterns.\nSome major questions we will address include: Have organisms evolved for\n“the good of the species”? Why do some animals cooperate, and why do\nwe see some patterns in the behaviours of the sexes? We’ll examine these topics in lecture, readings of both primary and review literature, discussion,\nand laboratory exercises which focus on the basics of analytical techniques\nused in evolutionary studies.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-3-1-4.5",
	"Prerequisite": "YC1122 Quantitative Reasoning and YC1131 Scientific Inquiry, although these requirements may change with curricular changes. Students are encouraged to have taken an elective that counts towards either a Life Science or Physical Science",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSC2221",
	"ModuleTitle": "Introduction to Python",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course introduces Python, a widely used high-level programming language. Its popularity is comparable to Java or C/C++. This means Python is practically useful and convenient to program and learn, since there are many resources/communities on the internet and many supporting libraries. Python was designed to be easy to learn, though many serious applications have been built based on it.",
	"CrossModule": "",
	"ModuleCredit": "2",
	"Workload": "0-3-0-0-2",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSC2222",
	"ModuleTitle": "Organic Chemistry Laboratory",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The structure, properties, and reactivity of carbon-based molecules will be directly observed and inferred in this laboratory-based course, which supplements YSC2224 Accelerated Organic Chemistry. Students will put their newly acquired theoretical knowledge in practice and thus gain a much deeper understanding of the material. Topics include reaction set-up and purification, IR, NMR, GC-MS and LC-MS analysis, as well as an advanced synthesis project.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-0-4-2-6.5",
	"Prerequisite": "Students must have either taken YSC2224 Accelerated Organic Chemistry previously or enrol into YSC2224 Accelerated Organic Chemistry concurrently, or with the permission of the instructor.",
	"Preclusion": "",
	"Corequisite": "YSC2224 Accelerated Organic Chemistry, if student has not previously taken it."
}, {
	"ModuleCode": "YSC2224",
	"ModuleTitle": "Accelerated Organic Chemistry",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The structure, properties, and reactivity of carbon-based molecules will be studied in depth, offering the foundation for understanding not only pharmaceuticals, dyes, polymers and other petrochemicals, but also the biochemical processes that constitute life. Topics will include covalent and ionic bonding, aromaticity and stereochemistry, addition and substitution reactions, carbonyl chemistry, molecular orbital theory, as well as Infrared and NMR spectroscopy. Taking YSC2222 Organic Chemistry Laboratory concurrently with YSC2224 is strongly recommended, so that students can put their newly acquired theoretical knowledge in practice and thus gain a much deeper understanding of the material.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-4-0-5.5",
	"Prerequisite": "YSC1207 General Chemistry: Molecular Structure and Reactivity OR with the permission of the instructor",
	"Preclusion": "Precludes previous module code of YSC2206",
	"Corequisite": "None, but YSC2222 Organic Chemistry Laboratory is strongly recommended."
}, {
	"ModuleCode": "YSC2225",
	"ModuleTitle": "Physical Chemistry",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The course aims to introduce the students to the physical chemistry concepts that are essential in understanding and investigating the molecular and macroscopic world. Students will also learn how quantum and computational chemistry can be applied in the prediction of molecular properties and its relevance to spectroscopy.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-1.5-1.5-5.5",
	"Prerequisite": "YSC1207 General Chemistry: Molecular Structure and Reactivity; AND YSC1213 General Physics: Electronics and Non-Linear Dynamics; OR with the permission of the instructor",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSC2227",
	"ModuleTitle": "C: A Language for Science and Engineering",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "C is one of the most commonly used programming languages, especially in science, engineering and electronics. Many operating systems and microcontrollers are at least partly coded in C. C is lightweight, fast and offers a complex memory management system. This apparent simplicity does not mean that it is simple to learn and master though, as it requires deep understanding of how memory works and how data is represented. In this course, we will cover the C language along with memory management and segmentation. C can be useful for Capstones in applied mathematics and natural sciences.",
	"CrossModule": "",
	"ModuleCredit": "2",
	"Workload": "0-3-0-5.5-1.5",
	"Prerequisite": "YSC2221 Introduction to Python or YSC1212 Introduction to Computer Science or permission of instructor",
	"Preclusion": "YSC3217 Programming Operating Systems, Interfaces & eXtras",
	"Corequisite": "none"
}, {
	"ModuleCode": "YSC2231",
	"ModuleTitle": "Foundations of Neuroscience",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course provides an introduction to neurobiology and equips students with the background necessary to understand key concepts and fundamental questions in studies of the nervous system and cognition. Students will learn about cellular and molecular neurobiology, neurophysiology, neuroanatomy, and neuroethology. This course should be of interest to students contemplating further studies in neuroscience, psychology, neuropharmacology, and behavioural ecology, or students considering careers in medical, veterinary, and behavioural sciences.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-2.5-6",
	"Prerequisite": "None",
	"Preclusion": "YSC2211 Neurobiology and Behaviour",
	"Corequisite": ""
}, {
	"ModuleCode": "YSC2232",
	"ModuleTitle": "Linear Algebra",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "A first course in linear algebra of finite-dimensional real and complex vector spaces, balancing theoretical and computational material. The course covers vectors and linear transformations, building geometric intuition, algebraic aptitude, and computational proficiency. Topics include spaces and subspaces, linear maps, linear independence and spanning, basis, and representations by coordinates and matrices. The theory of linear operators is developed, including eigenvalues and eigenvectors, self-adjoint operators, the spectral theorem, and the singular value decomposition. Some topics from numerical linear algebra, especially implementation of algorithms and assessment of their efficiency are included. Applications to statistics, economics, engineering and science are presented.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-0-8.5",
	"Prerequisite": "Any other MCS module OR with the permission of the instructor.",
	"Preclusion": "YSC3205 Linear Algebra (previous code)",
	"Corequisite": ""
}, {
	"ModuleCode": "YSC2233",
	"ModuleTitle": "Genetics",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course illustrates basic principles of genetics using examples from prokaryote and eukaryote organisms. It emphasizes classical genetic techniques and how genetics is used to gain understanding of whole organisms. The gene, its context and the genome are the primary concepts covered. The focus will be on Drosophila developmental genetics, yeast cell biology and human disease.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-3.5-6",
	"Prerequisite": "None",
	"Preclusion": "YSC3201 (previous module code)",
	"Corequisite": "None"
}, {
	"ModuleCode": "YSC2234",
	"ModuleTitle": "Human Biology",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course examines the anatomy and physiology of humans and other animals in an evolutionary and comparative framework. Major themes include the integration among physiological systems to maintain homeostasis; understanding biological structures as statements of homology; suboptimal or pathological adaptive solutions as the product of phylogenetic constraints or physiological trade-offs; and human adaptive plasticity in diverse environments. This course should be of interest to students wanting to learn about human and animal biology, chronic and metabolic pathologies in contemporary urban societies, or students considering careers in medical, veterinary, or pharmaceutical science.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-0-8.5",
	"Prerequisite": "None",
	"Preclusion": "YSC1201 (previous module code)",
	"Corequisite": "None"
}, {
	"ModuleCode": "YSC2239",
	"ModuleTitle": "Introduction to Data Science",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Data science has revolutionised modern life and technology using a broad spectrum of methods from Mathematics, Statistics and Computer Science. Intrinsically, mathematical and statistical techniques are married to modern computing power to provide accurate and complex tools to capture real life phenomena. In this course we develop an introduction to methods used in data science, at a level requiring basic mathematics and statistics.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-2-1-5-4.5",
	"Prerequisite": "A level mathematics or equivalent.",
	"Preclusion": "None",
	"Corequisite": "None"
}, {
	"ModuleCode": "YSC2242",
	"ModuleTitle": "More is Different: Emergence in Physical Systems",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "There is a strong belief in physics that the most important laws of nature are the ones governing at the smallest length scales-- the laws of anything larger are merely their corollaries. This course explores how ‘emergence’ challenges this worldview. Emergence is the thesis that laws governing macroscopic objects are often so different and unpredictable based on the underlying microscopic ones that the two sets of laws are in fact equally fundamental and conceptually distinct. Macroscopic higher level laws are then said to ‘emerge’ from the microscopic lower level ones. We will examine concrete examples from thermodynamics, mechanics and optics.",
	"CrossModule": "",
	"ModuleCredit": "2",
	"Workload": "0-1.5-0-1.5-2",
	"Prerequisite": "Nil",
	"Preclusion": "Nil",
	"Corequisite": "Nil"
}, {
	"ModuleCode": "YSC2243",
	"ModuleTitle": "Probability",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This is an introductory module in probability theory, which is essential for many MCS modules, as well as in other scientific disciplines such as biology and economics. The course covers the basic principles of the theory of probability and its applications.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-1.5-1.5-0-9.5",
	"Prerequisite": "None but knowledge of Calculus is advisable.",
	"Preclusion": "NA",
	"Corequisite": "NA"
}, {
	"ModuleCode": "YSC2244",
	"ModuleTitle": "Programming for Data Science",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "With the growing influence of Data Science, the Statistics and Mathematics domains now require specific skills in programming, using domain-specific systems and libraries. This course introduces common tools for  Data Science programming. This includes a high-level language (i.e. Python), several Statistics/AI libraries (i.e. numpy, sklearn), and database systems (i.e. SQL). In addition we will create awareness of best practices in programming such as control versioning, testing, and continuous integration.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-6-3.5",
	"Prerequisite": "YSC1212 Introduction to Computer Science or with the permission of the instructor.",
	"Preclusion": "None",
	"Corequisite": "None"
}, {
	"ModuleCode": "YSC3206",
	"ModuleTitle": "Introduction to Real Analysis",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course embarks on a deep study of the real numbers and functions of a\r\nsingle real variable. Fundamental properties of real numbers – arithmetic,\r\ndistance, limit, convergence, order – are developed from scratch. From\r\nthere, the course delves into the inner workings of calculus, the general\r\nnotions of continuity, differentiability, measure, and integration, for\r\nfunctions of one real variable.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-0-8.5",
	"Prerequisite": "YSC2209 Proof OR YSC2232 Linear Algebra",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSC3210",
	"ModuleTitle": "Introduction to Quantum Mechanics",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This first course on quantum mechanics introduces students to the\r\npostulates of quantum theory and then applies it to discuss problems like\r\ntwo level systems, quantum harmonic oscillators, the variational principle\r\nand the WKB approximation.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-5-0-0-7.5",
	"Prerequisite": "YSC2203 Classical Mechanics\r\nand\r\nYSC2205 Mathematical Methods for Physical Scientists\r\nor\r\nPermission of instructor",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSC3211",
	"ModuleTitle": "Introduction to Electrodynamics",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course introduces the basic concepts of electrodynamics, taught with\r\nthe full mathematical and physical rigor necessary for subsequent courses on\r\nthe subject. Topics typically include electrostatics and magnetostatics, both\r\nin free space and in media, dynamics as described by Maxwell’s equations,\r\nelectromagnetic waves, optics, and simple relativistic phenomena.\r\nIntroduction to electrodynamics is a core course for the Physics pathway within the Physical Science major.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-0-8.5",
	"Prerequisite": "YSC2205 Mathematical Methods for Physical Scientists\r\nor\r\nPermission of Instructor",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSC3215",
	"ModuleTitle": "Research Seminar",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course (a requirement for Life Science majors) is meant to prepare\r\nstudents for their capstone projects, in some cases quite specifically through\r\ntargeted readings and group presentations of relevant scientific literature,\r\nbut more generally through practice in close and critical assessment of\r\nscientific papers, the generation of new research ideas based on those\r\npapers, and the honing of presentation skills.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-4.5-5",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSC3232",
	"ModuleTitle": "Software Engineering",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course will teach principles of software engineering and object oriented programming as well as UI and Android. In this module, students will first learn about the Java language and the object paradigm (field encapsulation, object, polymorphism), as well as useful tools for software development (e.g. version control, debugging). The next part of the module will focus on how to write code properly and work on larger scale projects using MVC framework. Finally, the last part of the course will cover User Interfaces in Java, Threads, synchronization and Android Programming.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-5.5-4",
	"Prerequisite": "YSC2221 Introduction to Python or YSC1212 Introduction to Computer Science or permission of instructor",
	"Preclusion": "YSC3207 Principles and Tools of Software Development",
	"Corequisite": ""
}, {
	"ModuleCode": "YSC3236",
	"ModuleTitle": "Functional Programming and Proving",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Using the Coq Proof Assistant, we propose an integrated account of specifications, unit tests, implementations, and properties of functional programs, through a variety of examples.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "YSC1212 Introduction to Computer Science or with the permission of the instructor",
	"Preclusion": "NA",
	"Corequisite": "NA"
}, {
	"ModuleCode": "YSC3237",
	"ModuleTitle": "Introduction to Modern Algebra",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Algebra is the study of mathematical symbols and the rules used to manipulate them. Throughout the history of mathematics, algebraic methods have been developed to solve equations using simple, but important, properties of numbers that make meaningful calculations possible. Those properties arise in a variety of other settings, however, allowing us to make algebraic arguments in a significantly broader context. This course introduces modern algebra — specifically the mathematical objects called groups and rings — through a rigorous exploration of familiar notions, including permutations, symmetries, polynomials, and matrices, resulting in a cohesive, unifying theory with far-reaching applications throughout the natural sciences.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-4-4",
	"Prerequisite": "YSC2209 Proof",
	"Preclusion": "Precludes previous module codes of YSC3220 Rings and Fields & YSC3204 Group Theory, which have been consolidated into a single course YSC3237 Introduction to Modern Algebra.",
	"Corequisite": "N/A"
}, {
	"ModuleCode": "YSC3247",
	"ModuleTitle": "The Genomics of Human History",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course explores the role of genomes in inferring human history and prehistory. Through secondary texts and primary literature, we will study what is known about human origins in Africa, East Asia, Europe, India, New World, and Oceania as inferred from contemporary and ancient genomes. We will learn how to analyse genomic data; make phylogenetic inferences of historical patterns; and how to apply phylogenetic methods to cultural traits, such as inferring language trees from shared lexical cognates. Finally, we will explore how genomics impacts issues of health, sex, inequality, and identity.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-4-4.5",
	"Prerequisite": "N/A",
	"Preclusion": "N/A",
	"Corequisite": "N/A"
}, {
	"ModuleCode": "YSC3248",
	"ModuleTitle": "Parallel, Concurrent and Distributed Programming",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module will cover main concepts and programming paradigms for developing parallel concurrent and distributed systems, which is vital for implementing high-performance applications in areas such as machine learning, cloud computing, and databases --- areas with an extremely high demand for well-trained software engineers.  \n \nThe course contents will include both practical (about 70%) as well as a theoretical component, giving the students the basis to design concurrent algorithms, and reason about their correctness, as well as to be able to design experiments for estimating the performance of the designed algorithms.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "YSC1212 Introduction to Computer Science and YSC2229 Introductory Data Structures and Algorithms or with the permission of the instructor.",
	"Preclusion": "None",
	"Corequisite": "None"
}, {
	"ModuleCode": "YSC4101",
	"ModuleTitle": "Physical Sciences Capstone Project",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The Physical Sciences Capstone Project is a year-long 10-MC module, straddling over two semesters. It is a compulsory module that students in the Physical Sciences major must complete in order to graduate. It allows students the opportunity to pursue, in depth, an advanced project of their own choosing, while working closely with a faculty supervisor. Students will work on an advanced creative and/or research or experiential project that integrates skills from the Common Curriculum and learning in the major. The Capstone Project will culminate in a substantial piece of work that reflects a deep engagement with the topic.",
	"CrossModule": "",
	"ModuleCredit": "10",
	"Workload": "0-0-0-6-6.5",
	"Prerequisite": "Completion of all Year 1 and 2 Common Curriculum Modules",
	"Preclusion": "None",
	"Corequisite": "None"
}, {
	"ModuleCode": "YSC4102",
	"ModuleTitle": "Life Sciences Capstone Project",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The Life Sciences Capstone Project is a year-long 10-MC module, straddling over two semesters. It is a compulsory module that students in the Life Sciences major must complete in order to graduate. It allows students the opportunity to pursue, in depth, an advanced project of their own choosing, while working closely with a faculty supervisor. Students will work on an advanced creative and/or research or experiential project that integrates skills from the Common Curriculum and learning in the major. The Capstone Project will culminate in a substantial piece of work that reflects a deep engagement with the topic.",
	"CrossModule": "",
	"ModuleCredit": "10",
	"Workload": "0-3-0-6-3.5",
	"Prerequisite": "Completion of all Year 1 and 2 Common Curriculum Modules",
	"Preclusion": "None",
	"Corequisite": "None"
}, {
	"ModuleCode": "YSC4103",
	"ModuleTitle": "Maths, Computational & Statistical Sci Capstone Project",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The Maths, Computational & Statistical Science (MCS) Capstone Project is a year-long 10-MC module, straddling two semesters that students in the MCS major must complete in order to graduate. It allows students the opportunity to pursue, in depth, an advanced project of their own choosing, under the guidance of a faculty supervisor. The Capstone is intended to: \r\n• give students the opportunity to work independently;\r\n• encourage students to develop and exhibit aspects of their ability that may not be revealed by course work or a written examination;\r\n• foster skills and attributes that will be of continuing usefulness in their later career.",
	"CrossModule": "",
	"ModuleCredit": "10",
	"Workload": "0-0-0-6-6.5",
	"Prerequisite": "Completion of all Year 1 and 2 Common Curriculum Modules",
	"Preclusion": "None",
	"Corequisite": "None"
}, {
	"ModuleCode": "YSC4200",
	"ModuleTitle": "Special Project in Science",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course provides academic credit of major research projects conducted by students prior to the Capstone project.  The scope and depth of the research should be at the level of a Capstone project, and thus requires unusually strong preparation in science.  All projects must be approved by the Director of the Science Division before the course is selected.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-0-0-0-12.5",
	"Prerequisite": "Unusually strong preparation in science, and prior approval of the Director of the Science Division.",
	"Preclusion": "Nil",
	"Corequisite": "Nil"
}, {
	"ModuleCode": "YSC4200G",
	"ModuleTitle": "Special Project in Science",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course provides academic credit of major research projects conducted\nby students prior to the Capstone project. The scope and depth of the\nresearch should be at the level of a Capstone project, and thus requires\nunusually strong preparation in science. All projects must be approved by\nthe Director of the Science Division before the course is selected.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-0-0-0-12.5",
	"Prerequisite": "Unusually strong preparation in science, and prior approval of the Director of\nthe Science Division.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSC4209",
	"ModuleTitle": "Physical Science Research Seminar",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course (that counts towards the Physical Science major) is meant to expose students to current research areas in physical science and can be used to prepare for capstone projects though targeted readings and group presentations in specific areas of physical science. Critical assessment of scientific papers could lead to the generation of new research directions based on those papers.\nThis will be a year-long 4MC course (i.e. 2 MC each semester).",
	"CrossModule": "",
	"ModuleCredit": "4",
	"Workload": "0-1.5-0-2-2",
	"Prerequisite": "YSC2205 Maths Methods for Physical Scientists AND either YSC2203\nClassical Mechanics OR YSC2224 Organic Chemistry with Laboratory (or previously YSC2206 Principles of Organic Chemistry)",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSC4216",
	"ModuleTitle": "Machine Learning",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Machine learning is a collection of techniques where computers can learn from data without being explicitly programmed. For instance, when we train a program using human-face image data, it should be able to locate faces in an image; yet, if we train the same program using flower data, it should be able to locate flowers in an image, without explicitly changing the program itself. This module particularly will focus on statistical machine learning, which relies heavily on probabilistic and statistical analysis. Programming skill in python is compulsory.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "YSC2221 Introduction to Python and YSC2232 Linear Algebra OR with the permission of the instructor",
	"Preclusion": "YSC3227 (previous module code)",
	"Corequisite": "None"
}, {
	"ModuleCode": "YSS2201",
	"ModuleTitle": "Understanding Behavior and Cognition",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course will introduce students to themselves and others as viewed through the lens of psychology. We will present and explore the scientific study of human (and animal) behaviour, seeking to understand why we think, feel, and act as we do. The goal is to build a firm foundation for those wishing to major in psychology while simultaneously providing an interesting and revealing elective to those visiting psychology on their way to other disciplines.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-0-8.5",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS2202",
	"ModuleTitle": "International Relations",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course introduces students to concepts, theories, and cases associated with the study of international politics. We will study contemporary scholarly texts and examine empirical evidence relating to key historical experiences such as the Cold War, which inform contemporary international relations theories.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS2203",
	"ModuleTitle": "Intermediate Microeconomics",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Microeconomics analyses individual decision making and its implications for economic outcomes. Here the term “individual” is used broadly to include individuals, households and firms. We deconstruct the demand-supply model by analyzing consumers' choices as outcomes of rational preference maximization and producers' decisions as results of profit maximization in various market structures. We study how equilibrium of demand and supply in competitive markets generates efficient outcomes. We then analyze a variety of instances when markets fail to be efficient. This course will place special emphasis upon mathematical foundations of theoretical models. In particular, we will study and apply techniques in multivariate calculus, and unconstrained and constrained optimization.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-0-8.5",
	"Prerequisite": "YSS1203 Principles of Economics or A-level or equivalent Mathematics. To emphasize, prior knowledge of economics is NOT necessary to take Intermediate Microeconomics. If a student has completed A-level or equivalent Mathematics, then he/she is allowed to take Intermediate Microeconomics even if he/she has neither completed A-level or equivalent Economics nor YSS1203 Principles of Economics. Students without this background may enroll with instructors’ permission",
	"Preclusion": "",
	"Corequisite": "Nil"
}, {
	"ModuleCode": "YSS2211",
	"ModuleTitle": "Econometrics",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Does going to college increase your earnings? Does height have an effect your\nwage? Do episodes like the haze 2013 in Singapore have a major impact to the\neconomy? This course introduces students to the statistical methods that economists use to answer this and similar questions. More generally, this is an introduction to the methods used to test economic models and examine empirical relationships, primarily regression analysis. Although much of the course will focus on the mathematical development of the methodology, emphasis is placed on learning by studying and replicating specific case studies that address current economic questions.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "1-3-0-0-8.5",
	"Prerequisite": "Any one of the following three options: \n(i)\tYSS1203 Principles of Economics;\n(ii)\tYSS2203 Intermediate Microeconomics;\n(iii)\tA-level Economics and Mathematics or equivalent economics and mathematics courses",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS2214",
	"ModuleTitle": "Intermediate Macroeconomics",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Economics is concerned with the study of how individuals make decisions and how these decisions affect, and in turn are affected by, the distribution of limited resources in society. This course introduces students to the formal analysis of the economy as a whole. The goal is to understand how decisions by the firms, consumers and institutions affect the markets, and the welfare implications of such choices for society. Special attention is placed on the effect of government and monetary policies on the economy. Emphasis is placed upon the mathematical foundations of theoretical models.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-0-8.5",
	"Prerequisite": "Any one of the following three options: \n(i)\tYSS1203 Principles of Economics;\n(ii)\tYSS2203 Intermediate Microeconomics;\n(iii)\tA-level Economics and Mathematics or equivalent economics and mathematics courses",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS2216",
	"ModuleTitle": "Statistics and Research Methods for Psychology",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course is concerned with research methods and the use of statistics in psychology. As such this is a skills oriented course aimed at preparing students for taking the required laboratory course in psychology as well as doing their senior capstone project. We will be covering research methods and statistics simultaneously since they are closely intertwined.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-0-8.5",
	"Prerequisite": "YCC1122 Quantitative Reasoning and YSS2201 Understanding Behaviour and Cognition",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS2218",
	"ModuleTitle": "International Political Economy",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This class introduces students to the study of international political economy.\r\nStudents will examine the structure of the global political economy, the drivers\r\nand implications of globalization, and the role of international economic\r\ninstitutions in driving political and economic outcomes. Among others, this\r\nclass will cover topics such as international financial institutions, trade, financial crises, foreign aid, economic development, energy politics, and illicit\r\ntrade.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "YCC1121 Comparative Social Institutions",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS2220",
	"ModuleTitle": "Introduction to Urban Studies",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course offers an introduction to urban studies. It inquires into the evolution of cities historically as well as contemporary processes of urbanization. The course also introduces students to  key explanatory frameworks for understanding the contemporary economic and social function of cities. The course can be taken as a gateway to the Urban Studies major or as an elective.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "",
	"Preclusion": "YSS1207 (previous module code)",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS2231",
	"ModuleTitle": "The Anthropology of Politics and Law: An Introduction",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "An introduction to the comparative study of politics and law in different cultures across the world, past and present, focusing on the basic concepts necessary to analyse these, among them, the state, sovereignty, civil society, power, justice, rights. Based on examples drawn from Africa and Asia, and the Americas, the course will examine critically many of the taken for granted terms of public discourse, among them, democracy, and explore the historically changing relationship between government, politics, and judicial processes.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-1-8.5",
	"Prerequisite": "None",
	"Preclusion": "None",
	"Corequisite": "None"
}, {
	"ModuleCode": "YSS2232",
	"ModuleTitle": "Medicine, Culture and Modernity",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This class examines the changing place of medicine in the long history of modernity. Focusing on key moments (the birth of the clinic, the colonial encounter, the consolidation of medicine as profession, the age of genomics and bio-capital, and the empire of global health) it explores the distinctive role of medical knowledge and practice in the making of modernist persons, identities, economies, and political vocabularies. Readings are drawn from anthropology and the wider social sciences, with cases from Africa, Asia, Europe, and North America. The course is a mix of lecture and discussion.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "None",
	"Preclusion": "None",
	"Corequisite": "None"
}, {
	"ModuleCode": "YSS2233",
	"ModuleTitle": "Investment Analysis and Economics",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The course is meant for students who wish to familiarize themselves with the principles of investment analysis, and to understand how economic concepts feed into investment processes. It provides students with a foundational understanding of the structure of global public markets (equities, bonds and currencies), key investment theories and tools for analysing assets. In particular, it familiarizes students with concepts from macro-, micro- and behavioural economics that are relevant for making investment decisions. The course is designed from the perspective of an investment professional and draws on real-world examples and applications.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-4.5-4",
	"Prerequisite": "Any one of the following: (i) YSS1203 Principles of Economics (ii) A-level Economics or equivalent (iii) YSS2203 Intermediate Microeconomics (iv)  YSS2214 Intermediate Macroeconomics or with the permission of the instructor.",
	"Preclusion": "None",
	"Corequisite": "None"
}, {
	"ModuleCode": "YSS2234",
	"ModuleTitle": "The Good Company",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "What is the purpose of a company? Is it only to make money? The Good Company will investigate the changing nature of the modern corporation and its impact on society, both good and bad. We will also develop an understanding of ethical investments and the role such firms play in impacting the behaviour of modern corporations. Shortcomings in the current ethical investment framework will be covered, with a new paradigm (The Good Company Index) analysed as an alternative.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-4.5-5",
	"Prerequisite": "None",
	"Preclusion": "None",
	"Corequisite": "None"
}, {
	"ModuleCode": "YSS3201",
	"ModuleTitle": "International Migration",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "An introduction to foundational theories that explain why people migrate and their post-migration experiences. The first half of the course focuses on factors that influence the decision to leave one's home country and migrate elsewhere. The second half of the course focuses on the impact of migration on the migrants themselves, the countries they move to, and the countries they leave behind. Over the course of the semester, students will also research specific migration streams to Singapore of their choosing in a structured manner.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-3.5-5",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS3205",
	"ModuleTitle": "International Trade",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "In this course, we will study the theoretical and empirical foundations and\r\npolicies of international trade at a fairly abstract and rigorous level. The\r\ncourse materials and lectures will employ mathematics. The issues that will\r\nbe addressed include the causes of international trade, the gains from trade,\r\nthe role of international capital movements, the effects of trade and\r\ninvestment barriers, etc. We will also read about real-world areas of trade, such as trade institutions, the interactions between trade and development\r\nissues, etc. We will study models in trade and apply them to questions of\r\ninterest in the real world.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-5-4.5",
	"Prerequisite": "YSS2203 Intermediate Microeconomics",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS3208",
	"ModuleTitle": "Advanced Microeconomics",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This broadly covers the same range of topics as ‘Intermediate Economics’.\r\nHowever it has a more intensive treatment of consumer and producer\r\ntheory, and covers additional topics like choice under uncertainty, game\r\ntheory, contracting under hidden actions or hidden information, externalities\r\nand public goods, asset pricing, auctions, and general equilibrium theory.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-5-4.5",
	"Prerequisite": "YSS2203 Intermediate Microeconomics",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS3214",
	"ModuleTitle": "Abnormal Psychology",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course introduces students to the field of abnormal psychology and the\r\ntreatment of psychological disorders.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-2-6.5",
	"Prerequisite": "YSS2201 Understanding Behaviour and Cognition",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS3222",
	"ModuleTitle": "Urban Theory",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course introduces students to key theoretical approaches in urban studies. Throughout the semester, we will read selections from essential texts in the field, examining both their methodological techniques and theoretical contributions to understanding cities and urbanization. The course takes an interdisciplinary approach and is divided into three or four thematic units, which in previous iterations have covered topics such as modernity, justice, economy, spatiality, and infrastructure.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-1-8.5",
	"Prerequisite": "YCC2121 Modern Social Thought and YSS2220 Introduction to Urban Studies",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS3231",
	"ModuleTitle": "Methods in the Social Sciences",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "An introduction to various research methods in the social sciences, including\r\nsurvey methodology, quantitative data analysis, participant observation, and\r\nin-depth interviewing. This course can count as a course in the major for\r\nstudents in Urban Studies, Global Affairs, PPE, and Anthropology. It may fulfil\r\nthe course requirements for students in Environmental Studies as well on a\r\ncase-by-case basis after consultation with the Head of Studies of that major.\r\n\r\nThe course also fulfils the methods requirement in Urban Studies and Global\r\nAffairs. Students in all of these majors should ideally take this course before\r\nthey commence their capstone project.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-1-4.5-4",
	"Prerequisite": "YCC1121 Comparative Social Institutions, YCC1122 Quantitative Reasoning,\r\nAND YCC2121 Modern Social Thought OR with the permission of the\r\ninstructor.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS3236",
	"ModuleTitle": "Foreign Policy and Diplomacy: Issues and Practice",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course introduces students to foreign policy, which is the approach\r\nstates adopt in their international relationships, and to diplomacy, one of the\r\nkey tools for implementing foreign policy. It provides an Asia-centred\r\nperspective on foreign policy and diplomacy, and provides insight into the\r\nrealities of practitioners in the field. It will cover concepts in foreign policy analysis and strategies as well as laws and practices of diplomatic relations. It\r\nwill explore the unique experiences of Singapore’s foreign policy. Bilateral\r\nand multilateral diplomacy will be discussed in the Singaporean context and\r\nstudents may be exposed to practitioners in the classroom.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-2.5-7",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS3245",
	"ModuleTitle": "Key Debates in Urban Planning and Policy",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course explores key debates in contemporary urban planning and policy, including questions of agglomeration, property rights, rationality, democracy, diversity, and justice. While these questions are crucial for successfully intervening in contemporary urban transformation, they are not new. Rather, they are part of ongoing debates that stretch back to the origins of urban planning and policy. In order to understand the issues facing contemporary urban planning, it is therefore necessary to excavate their historical development. Through this excavation, we will develop informed positions on contemporary practice in urban planning and policy.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-3-6.5",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS3246",
	"ModuleTitle": "Cities of the Global South",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course offers students an in-depth inquiry into the characteristics of urban organization and development in cities of the Global South, where there are high rates of urbanization. Students will examine a range of topics: migration and urbanization, formal and informal governance, housing and infrastructure, food security and environment. Students will also learn about the competing theoretical constructs used to explain such urbanization. Case studies will be drawn from a range of geographical locations.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-3-6.5",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS3249",
	"ModuleTitle": "Human Neuroscience",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The course provides an introduction to the nervous system, with a particular emphasis on the structure and function of the human brain. Topics include the anatomy and function of nerve cells, sensory systems, and the brain as a whole, as well as exploration of the neural basis of learning, memory, perception, reward, emotion, social thinking, and the control of movement. Diseases of the nervous system and neuropharmacology will also be discussed.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-3-6.5",
	"Prerequisite": "YSS2201 Understanding Behavior and Cognition OR YSC2211 Neurobiology & Behavior",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS3250",
	"ModuleTitle": "Cityscapes and Urban Form",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course provides students with an understanding of architectural styles\nand urban morphology. Urban built environments are the result of a range\nof processes that reflect everything from cultural taste, to political\nideology, to economic behavior, to technological capability. This course\nprovides students with the analytical tools to better understand the\nformation of cityscapes and their consequences. The course will tackle\nthese questions through a range of scales, from site-specific building scale,\nto the neighbourhood or quarter scale, to mega-forms and grand projects,\nand beyond. It will do so through a range of emblematic projects and cases\nstudies.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-5-4.5",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS3254",
	"ModuleTitle": "Globalization on the Ground",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course takes an ethnographic approach to the study of globalization, focusing on the impact it has on the daily lives of individuals, families, and communities around the world, and how they have responded in turn. Introducing students to how interpretative social science disciplines have approached the study of globalization, students will be assigned readings on different manifestations of globalization, including but not limited to the McDonaldization of society, the materials that enable globalization to take place, the international labor migration industry, the structure and composition of global cities, global crime, and the rise of anti-globalization social movements.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-3-5.5",
	"Prerequisite": "YCC1121 Comparative Social Inquiry",
	"Preclusion": "YSS2222 (previous module code)",
	"Corequisite": "YCC2121 Modern Social Thought"
}, {
	"ModuleCode": "YSS3258",
	"ModuleTitle": "Early Stage Private Equity Investing",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module will cover how returns from private equity investment are achieved through operational improvements and financial restructuring of growth and new venture companies. This is an introduction to the evaluation, structuring, stewardship, and realization of early stage private equity investments. We study cases of increasingly complex topics concerning cash flow, investment assessment, value assessment and creation, legal constraints, leadership, business development and economics and, ultimately, returns on investment.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-4-0-4.5-4",
	"Prerequisite": "YSS2211 Econometrics and YSS2203 Intermediate Microeconomics or with the permission of the instructor.",
	"Preclusion": "YSS3257 Seminar on Corporate Finance",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS3273",
	"ModuleTitle": "GIS and Demographics",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module is designed to introduce the concepts of geospatial analysis and demographic analysis. The course offers students the opportunity to understand the operational processes of spatial data acquisition, spatial and demographic analysis, and mapping and dynamic visualization. Students will also explore a variety of urban issues, such as gentrification and racial segregation, using two tools: ArcGIS software packages and STATA.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-2-1-4-5.5",
	"Prerequisite": "N/A",
	"Preclusion": "N/A",
	"Corequisite": "N/A"
}, {
	"ModuleCode": "YSS3277",
	"ModuleTitle": "The Anthropological Imagination",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The Anthropological Imagination offers an insights to the practice and creative power of anthropology. The aim of the course is to offer an introduction to how anthropologists, past and present, have viewed the world and approached the study of the human condition. The first half of the course examines foundational figures and moments in the history of the discipline. The second half of the course is geared toward an exploration of recent anthropological writings on topics such as power, representation, history, gender, the Anthropocene, and post-human anthropology.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "YCC2121 Modern Social Thought and YCC1121 Comparative Social Inquiry",
	"Preclusion": "YSS2209 (previous module code)",
	"Corequisite": "None"
}, {
	"ModuleCode": "YSS3291",
	"ModuleTitle": "Economics of Globalisation",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module studies the process of globalisation and its impact on various aspects of the global economy. The module has a particular focus on globalisation and economic development, but we will keep eyes on the other pressing issues on globalization and its recent reversal. The main questions to be addressed include (but are not limited to): (1) the nexus between trade and development; (2) globalisation and migration; (3) urbanization in an open economy; (4) identity politics and antiglobalisation movement.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-3-6.5",
	"Prerequisite": "YSS2203 Intermediate Microeconomics or with the permission of the instructor.",
	"Preclusion": "NA",
	"Corequisite": "NA"
}, {
	"ModuleCode": "YSS4101",
	"ModuleTitle": "Global Affairs Capstone Project",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The Global Affairs Capstone Project is a year-long 10-MC module, straddling over two semesters. It is a compulsory module that students in the Global Affairs major must complete in order to graduate. It allows students the opportunity to pursue, in depth, an advanced project of their own choosing, while working closely with a faculty supervisor. Students will work on an advanced creative and/or research or experiential project that integrates skills from the Common Curriculum and learning in the major. The Capstone Project will culminate in a substantial piece of work that reflects a deep engagement with the topic.",
	"CrossModule": "",
	"ModuleCredit": "10",
	"Workload": "0-2-0-2-8.5",
	"Prerequisite": "Completion of all Year 1 and 2 Common Curriculum Modules",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS4102",
	"ModuleTitle": "Psychology Capstone Project",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The Psychology Capstone Project is a year-long 10-MC module, straddling over two semesters. It is a compulsory module that students in the Psychology major must complete in order to graduate. It allows students the opportunity to pursue, in depth, an advanced project of their own choosing, while working closely with a faculty supervisor. Students will work on an advanced creative and/or research or experiential project that integrates skills from the Common Curriculum and learning in the major. The Capstone Project will culminate in a substantial piece of work that reflects a deep engagement with the topic.",
	"CrossModule": "",
	"ModuleCredit": "10",
	"Workload": "0-4-0-4-4.5",
	"Prerequisite": "Completion of all Year 1 and 2 Common Curriculum Modules",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS4103",
	"ModuleTitle": "Anthropology Capstone Project",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The Anthropology Capstone Project is a year-long 10-MC module, straddling over two semesters. It is a compulsory module that students in the Anthropology major must complete in order to graduate. It allows students the opportunity to pursue, in depth, an advanced project of their own choosing, while working closely with a faculty supervisor. Students will work on an advanced creative and/or research or experiential project that integrates skills from the Common Curriculum and learning in the major. The Capstone Project will culminate in a substantial piece of work that reflects a deep engagement with the topic.",
	"CrossModule": "",
	"ModuleCredit": "10",
	"Workload": "0-3-0-2-7.5",
	"Prerequisite": "Completion of all Year 1 and 2 Common Curriculum Modules",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS4104",
	"ModuleTitle": "Economics Capstone Project",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The Economics Capstone Project is a year-long 10-MC module, straddling over two semesters. It is a compulsory module that students in the Economics major must complete in order to graduate. It allows students the opportunity to pursue, in depth, an advanced project of their own choosing, while working closely with a faculty supervisor. Students will work on an advanced creative and/or research or experiential project that integrates skills from the Common Curriculum and learning in the major. The Capstone Project will culminate in a substantial piece of work that reflects a deep engagement with the topic.",
	"CrossModule": "",
	"ModuleCredit": "10",
	"Workload": "0-3-0-2-7.5",
	"Prerequisite": "Completion of all Year 1 and 2 Common Curriculum Modules",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS4105",
	"ModuleTitle": "Urban Studies Capstone Project",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The Urban Studies Capstone Project is a year-long 10-MC module, straddling over two semesters. It is a compulsory module that students in the Urban Studies major must complete in order to graduate. It allows students the opportunity to pursue, in depth, an advanced project of their own choosing, while working closely with a faculty supervisor. Students will work on an advanced creative and/or research or experiential project that integrates skills from the Common Curriculum and learning in the major. The Capstone Project will culminate in a substantial piece of work that reflects a deep engagement with the topic.",
	"CrossModule": "",
	"ModuleCredit": "10",
	"Workload": "0-2-0-5-5.5",
	"Prerequisite": "Completion of all Year 1 and 2 Common Curriculum Modules",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS4106",
	"ModuleTitle": "Politics, Philosophy and Economics Capstone Project",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The Politics, Philosophy and Economics (PPE) Capstone Project is a year-long 10-MC module, straddling over two semesters. It is a compulsory module that students in the PPE major must complete in order to graduate. It allows students the opportunity to pursue, in depth, an advanced project of their own choosing, while working closely with a faculty supervisor. Students will work on an advanced creative and/or research or experiential project that integrates skills from the Common Curriculum and learning in the major. The Capstone Project will culminate in a substantial piece of work that reflects a deep engagement with the topic.",
	"CrossModule": "",
	"ModuleCredit": "10",
	"Workload": "0-3-0-4-5.5",
	"Prerequisite": "Completion of all Year 1 and 2 Common Curriculum Modules",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS4107",
	"ModuleTitle": "Capstone Project",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "The Law and Liberal Arts DDP Capstone Project is a year-long 10-MC module straddling two semesters. It is a compulsory module that students in the DDP programme must complete in order to graduate. It allows students the opportunity to pursue, in depth, an advanced project of their own choosing while working closely with a supervisor. Students will work on an advanced research project that integrates both the Law and Liberal Arts components of the DDP programme.",
	"CrossModule": "",
	"ModuleCredit": "10",
	"Workload": "0-0-0-0-12.5",
	"Prerequisite": "Completion of all Year 1 and 2 Common Curriculum Modules",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS4206C",
	"ModuleTitle": "Topics in Psychology: The Pursuit of Happiness",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "In this course, we will explore scientifically-validated strategies to living a better life. We will review the current literature in positive psychology, and explore how psychological findings can teach us how to be happier, feel less stressed and to live a more fulfilling life.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-4-5.5",
	"Prerequisite": "YSS2201 Understanding Behaviour and Cognition or with the permission of the instructor.",
	"Preclusion": "None",
	"Corequisite": "None"
}, {
	"ModuleCode": "YSS4220",
	"ModuleTitle": "Housing and Social Inequality",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Housing is an essential necessity for living. The housing unit is concurrently a consumption good and an investment good. As a commodity, the quality and quantity of housing distribution and consumption are unequal, reflecting intrinsic social and economic inequalities in the society. As the logic and practice of the housing market unavoidably fail in providing adequate housing for all, the state is left with the responsibility of providing for those that the market has marginalized. This module will examine the role of the market and the state in engendering and perpetuating social and economic inequalities through the housing provision.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-5-4.5",
	"Prerequisite": "YSS2220 Introduction to Urban Studies and YCC2121 Modern Social Thought, or with approval of the instructor",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS4223",
	"ModuleTitle": "Politics of Identity in Developing Countries",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course is an upper level seminar that engages students in the study of identity and politics within political science. Students will become acquainted with various theories and approaches to understanding the construction and mobilization of identities: national, ethnic, religious, gender and sexual orientation. Drawing on the empirical literature on the politics of identity in Sub-Saharan Africa, South Asia, and Southeast Asia, students will learn how identities have been constructed, and how they in turn influence outcomes such as violence, voting behaviour, governance, inequality, and inter-group trust and cooperation.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-3-6.5",
	"Prerequisite": "YCC1121 Comparative Social Inquiry, YCC1122 Quantitative Reasoning. Recommended: YSS3231 Methods in the Social Sciences and/or YSS2211 Econometrics",
	"Preclusion": "YSS3234 (previous module code)",
	"Corequisite": "YSS1206 Introduction to Comparative Politics"
}, {
	"ModuleCode": "YSS4227",
	"ModuleTitle": "Topics in Applied Econometrics",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course covers econometric techniques as applied in empirical work in economics, at a level that is accessible to advance undergraduates. The topics are divided into two categories: Market Valuations and Non-Market Valuations. We begin with demand and supply estimation and the computation of consumer and producer surpluses. We investigate the use of surplus measurements to evaluate the impact of policies and the introduction of new good. We then move towards estimating the ‘demand side’ of environmental economics. The focus will be on stated and revealed preferences techniques for estimating the non-market values associated with environmental and other public goods.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-4.5-5",
	"Prerequisite": "YSS2203 Intermediate Microeconomics and YSS2211 Econometrics",
	"Preclusion": "NA",
	"Corequisite": "NA"
}, {
	"ModuleCode": "YSS4248",
	"ModuleTitle": "Conducting Qualitative Socio-Legal Research",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This seminar is designed to guide students toward developing proposals focused on qualitative socio-legal research. Students will be introduced to socio-legal literature, the conduct of socio-legal inquiry, and a mix of relevant research methodologies. They will undertake substantial work outside of class, reading targeted literature, identifying research questions, organizing their research strategies and completing assignments that will lead to their research proposals. This course is suitable for – but not limited to – students in their penultimate year, who plan to undertake capstone projects related to law or interdisciplinary research that involves legal norms, rules, or rights and their relationship to social relations or change.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS4249",
	"ModuleTitle": "The Economics of Inequality",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Due to the fact that it is rising and more visible than in the past economic inequality is emerging as an important social concern. This course covers the basic facts of the matter and the models used to understand the causes and consequences of the phenomenon.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-4.5-5",
	"Prerequisite": "YSS2203 Intermediate Microeconomics or YSS2214 Intermediate Macroeconomics OR with the instructor’s permission.",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS4250",
	"ModuleTitle": "Gender and Sexuality in South Asia",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This course examines how anthropologists address themes of gender and sexuality in South Asia through reading recent ethnographies. The course introduces students to varied ways that ideas about gender and sexuality, and social relations of gender are constructed, maintained, and challenged in South Asia. Issues to be explored include marriage, kinship and the body; religion and nationalism; masculinity studies; gender and violence; globalization and international gender development; globalization, education and work; sex work; queer activism and transgender identities. Emphasis is on India but other parts of the region are also considered (Pakistan, Nepal, Bangladesh, Sri Lanka). Films will supplement readings.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "At least one 2000 or 3000 Anthropology course, or with the permission\nof instructor",
	"Preclusion": "",
	"Corequisite": ""
}, {
	"ModuleCode": "YSS4252",
	"ModuleTitle": "Theory from the South: Critical Perspectives",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "This module offers a critical excursion into social theory from the perspective of the “global south,” broadly conceived; that is, theory which questions the orthodoxies arising from the modernist, EuroAmerican social sciences. It explores foundational concepts by estranging them: among others, personhood, liberalism and neoliberalism, democracy, modernity, the nation and its borders, civil society, sovereignty, history, crime and social order. Taking Africa as one of its exemplary contexts, it will explore and evaluate some of the critiques levelled by non-western scholars at “classical” wisdom, its relationship to colonialism and empire, and the rise of industrial capitalism.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "None",
	"Preclusion": "None",
	"Corequisite": "None"
}, {
	"ModuleCode": "YSS4253",
	"ModuleTitle": "Ethnography as Theory and Method: Classical and Contemporary Readings",
	"AcadYear": "2019/2020",
	"SemesterName": "Semester 1",
	"Faculty": "YALE-NUS COLLEGE",
	"Department": "YALE-NUS COLLEGE",
	"ModuleDescription": "Anthropologists have long argued against the radical separation of theory and method. Not only does ethnographic observation shape the knowledge it produces; anthropology’s commitment to an intersubjective world determines the kind of embedded observation, “thick description” and “grounded theory” that are its stock-in-trade. But what are ethnography and grounded theory in our late modern world, when many of the humanist assumptions on which anthropology was founded have come under critique - feminist, Marxist, queer, and postcolonial? Drawing on ethnographies past and present, this class will explore these questions through a close engagement with ethnographic texts, past and present.",
	"CrossModule": "",
	"ModuleCredit": "5",
	"Workload": "0-3-0-0-9.5",
	"Prerequisite": "NA",
	"Preclusion": "NA",
	"Corequisite": "NA"
}]